{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "/": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      ":": 24,
      ";": 25,
      "=": 26,
      "?": 27,
      "[": 28,
      "]": 29,
      "_": 30,
      "a": 31,
      "b": 32,
      "c": 33,
      "d": 34,
      "e": 35,
      "f": 36,
      "g": 37,
      "h": 38,
      "i": 39,
      "j": 40,
      "k": 41,
      "l": 42,
      "m": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "q": 47,
      "r": 48,
      "s": 49,
      "t": 50,
      "u": 51,
      "v": 52,
      "w": 53,
      "x": 54,
      "y": 55,
      "z": 56,
      "’": 57,
      "##a": 58,
      "##x": 59,
      "##i": 60,
      "##m": 61,
      "##u": 62,
      "##h": 63,
      "##n": 64,
      "##g": 65,
      "##e": 66,
      "##o": 67,
      "##c": 68,
      "##l": 69,
      "##d": 70,
      "##s": 71,
      "##w": 72,
      "##t": 73,
      "##r": 74,
      "##f": 75,
      "##3": 76,
      "##8": 77,
      "##y": 78,
      "##9": 79,
      "##p": 80,
      "##5": 81,
      "##4": 82,
      "##7": 83,
      "##6": 84,
      "##2": 85,
      "##v": 86,
      "##1": 87,
      "##0": 88,
      "##k": 89,
      "##,": 90,
      "##b": 91,
      "##z": 92,
      "##q": 93,
      "##?": 94,
      "##j": 95,
      "##.": 96,
      "##_": 97,
      "##!": 98,
      "th": 99,
      "the": 100,
      "to": 101,
      "##st": 102,
      "##in": 103,
      "##th": 104,
      "##le": 105,
      "##ve": 106,
      "of": 107,
      "##ove": 108,
      "st": 109,
      "##ile": 110,
      "##ar": 111,
      "##or": 112,
      "tile": 113,
      "then": 114,
      "##ou": 115,
      "##nd": 116,
      "fr": 117,
      "##ge": 118,
      "##ast": 119,
      "and": 120,
      "east": 121,
      "##id": 122,
      "frid": 123,
      "fridge": 124,
      "##orth": 125,
      "north": 126,
      "##est": 127,
      "move": 128,
      "ne": 129,
      "##at": 130,
      "near": 131,
      "sou": 132,
      "south": 133,
      "ca": 134,
      "west": 135,
      "##ll": 136,
      "stove": 137,
      "##ra": 138,
      "on": 139,
      "tiles": 140,
      "##ink": 141,
      "pink": 142,
      "##re": 143,
      "##ing": 144,
      "##ir": 145,
      "po": 146,
      "can": 147,
      "##ed": 148,
      "##ha": 149,
      "cha": 150,
      "go": 151,
      "chair": 152,
      "you": 153,
      "##ue": 154,
      "##ow": 155,
      "##nt": 156,
      "##er": 157,
      "##art": 158,
      "start": 159,
      "##llow": 160,
      "##et": 161,
      "ba": 162,
      "##ct": 163,
      "that": 164,
      "##en": 165,
      "##all": 166,
      "##bin": 167,
      "##binet": 168,
      "##ally": 169,
      "cabinet": 170,
      "fin": 171,
      "##om": 172,
      "##ic": 173,
      "finally": 174,
      "##ate": 175,
      "##war": 176,
      "##ward": 177,
      "##ect": 178,
      "##ject": 179,
      "##ea": 180,
      "ye": 181,
      "yellow": 182,
      "##wards": 183,
      "tra": 184,
      "gra": 185,
      "gray": 186,
      "##ory": 187,
      "##jectory": 188,
      "trajectory": 189,
      "##lic": 190,
      "polic": 191,
      "policy": 192,
      "from": 193,
      "are": 194,
      "towards": 195,
      "area": 196,
      "##ur": 197,
      "co": 198,
      "##tu": 199,
      "##ble": 200,
      "bath": 201,
      "##tub": 202,
      "bathtub": 203,
      "gen": 204,
      "##erate": 205,
      "generate": 206,
      "moves": 207,
      "it": 208,
      "##op": 209,
      "red": 210,
      "stop": 211,
      "##ss": 212,
      "stat": 213,
      "statue": 214,
      "##int": 215,
      "point": 216,
      "##gh": 217,
      "##rou": 218,
      "pa": 219,
      "##ch": 220,
      "pass": 221,
      "rea": 222,
      "reach": 223,
      "at": 224,
      "in": 225,
      "ta": 226,
      "is": 227,
      "##ck": 228,
      "table": 229,
      "cont": 230,
      "contin": 231,
      "##es": 232,
      "##urn": 233,
      "passing": 234,
      "be": 235,
      "back": 236,
      "continue": 237,
      "##nti": 238,
      "##nge": 239,
      "##it": 240,
      "ora": 241,
      "orange": 242,
      "unti": 243,
      "until": 244,
      "wh": 245,
      "##ay": 246,
      "gre": 247,
      "throu": 248,
      "through": 249,
      "##an": 250,
      "green": 251,
      "##east": 252,
      "fan": 253,
      "stay": 254,
      "##ead": 255,
      "head": 256,
      "##ore": 257,
      "##west": 258,
      "##fore": 259,
      "before": 260,
      "##on": 261,
      "##ep": 262,
      "bed": 263,
      "going": 264,
      "fo": 265,
      "follow": 266,
      "so": 267,
      "##fa": 268,
      "sofa": 269,
      "starts": 270,
      "turn": 271,
      "goes": 272,
      "##im": 273,
      "by": 274,
      "##ion": 275,
      "tim": 276,
      "end": 277,
      "##ain": 278,
      "##ping": 279,
      "stopping": 280,
      "an": 281,
      "##ft": 282,
      "##lor": 283,
      "color": 284,
      "hi": 285,
      "##lue": 286,
      "blue": 287,
      "##estep": 288,
      "timestep": 289,
      "able": 290,
      "northeast": 291,
      "##irc": 292,
      "circ": 293,
      "file": 294,
      "circle": 295,
      "cre": 296,
      "create": 297,
      "##me": 298,
      "##to": 299,
      "onto": 300,
      "for": 301,
      "aft": 302,
      "after": 303,
      "wi": 304,
      "ag": 305,
      "##ple": 306,
      "again": 307,
      "##ke": 308,
      "pur": 309,
      "purple": 310,
      "tiled": 311,
      "northwest": 312,
      "colored": 313,
      "##ite": 314,
      "white": 315,
      "##ition": 316,
      "##ame": 317,
      "##sition": 318,
      "ma": 319,
      "##igh": 320,
      "##ight": 321,
      "with": 322,
      "southwest": 323,
      "position": 324,
      "make": 325,
      "##us": 326,
      "##round": 327,
      "cact": 328,
      "cactus": 329,
      "around": 330,
      "southeast": 331,
      "##oc": 332,
      "ret": 333,
      "return": 334,
      "##ill": 335,
      "still": 336,
      "##se": 337,
      "same": 338,
      "stops": 339,
      "##ner": 340,
      "cor": 341,
      "corner": 342,
      "##ther": 343,
      "there": 344,
      "right": 345,
      "##ig": 346,
      "##ated": 347,
      "starting": 348,
      "mo": 349,
      "##em": 350,
      "loc": 351,
      "wa": 352,
      "while": 353,
      "##ving": 354,
      "up": 355,
      "cl": 356,
      "located": 357,
      "di": 358,
      "ro": 359,
      "moving": 360,
      "room": 361,
      "clo": 362,
      "##ich": 363,
      "which": 364,
      "##av": 365,
      "##avig": 366,
      "navig": 367,
      "navigate": 368,
      "rem": 369,
      "remain": 370,
      "ends": 371,
      "##ly": 372,
      "reaches": 373,
      "ob": 374,
      "object": 375,
      "continues": 376,
      "##xt": 377,
      "next": 378,
      "sl": 379,
      "##ro": 380,
      "##nter": 381,
      "##ive": 382,
      "##ome": 383,
      "##is": 384,
      "reaching": 385,
      "beg": 386,
      "fur": 387,
      "begin": 388,
      "further": 389,
      "some": 390,
      "##other": 391,
      "##ction": 392,
      "another": 393,
      "int": 394,
      "into": 395,
      "staying": 396,
      "ke": 397,
      "age": 398,
      "close": 399,
      "agent": 400,
      "keep": 401,
      "time": 402,
      "sp": 403,
      "##lk": 404,
      "walk": 405,
      "##ross": 406,
      "eastward": 407,
      "##rection": 408,
      "direction": 409,
      "no": 410,
      "enter": 411,
      "##ere": 412,
      "le": 413,
      "top": 414,
      "left": 415,
      "heading": 416,
      "bo": 417,
      "timesteps": 418,
      "slight": 419,
      "want": 420,
      "##60": 421,
      "my": 422,
      "slightly": 423,
      "name": 424,
      "rest": 425,
      "##if": 426,
      "##20": 427,
      "##wor": 428,
      "##twor": 429,
      "networ": 430,
      "network": 431,
      "##by": 432,
      "nearby": 433,
      "pr": 434,
      "##oce": 435,
      "proce": 436,
      "proceed": 437,
      "##ific": 438,
      "objects": 439,
      "give": 440,
      "given": 441,
      "cross": 442,
      "al": 443,
      "ending": 444,
      "remains": 445,
      "##out": 446,
      "##ant": 447,
      "##ce": 448,
      "##ually": 449,
      "##ec": 450,
      "sh": 451,
      "sq": 452,
      "##uar": 453,
      "squar": 454,
      "##ide": 455,
      "square": 456,
      "##ation": 457,
      "this": 458,
      "eastwards": 459,
      "stays": 460,
      "des": 461,
      "##ise": 462,
      "##wise": 463,
      "##ckwise": 464,
      "now": 465,
      "ar": 466,
      "clockwise": 467,
      "spec": 468,
      "finis": 469,
      "arr": 470,
      "finish": 471,
      "without": 472,
      "20": 473,
      "any": 474,
      "specific": 475,
      "side": 476,
      "followed": 477,
      "39": 478,
      "40": 479,
      "as": 480,
      "eve": 481,
      "where": 482,
      "##ld": 483,
      "both": 484,
      "##ould": 485,
      "event": 486,
      "eventually": 487,
      "should": 488,
      "28": 489,
      "its": 490,
      "24": 491,
      "##ong": 492,
      "along": 493,
      "step": 494,
      "##cend": 495,
      "399": 496,
      "##ot": 497,
      "##fere": 498,
      "spot": 499,
      "280": 500,
      "arrive": 501,
      "200": 502,
      "##ffere": 503,
      "differe": 504,
      "different": 505,
      "360": 506,
      "##itch": 507,
      "240": 508,
      "320": 509,
      "past": 510,
      "sem": 511,
      "##tt": 512,
      "##owly": 513,
      "slowly": 514,
      "bott": 515,
      "bottom": 516,
      "160": 517,
      "80": 518,
      "returning": 519,
      "##antic": 520,
      "semantic": 521,
      "),": 522,
      "fe": 523,
      "lo": 524,
      "few": 525,
      "sw": 526,
      "loop": 527,
      "switch": 528,
      "120": 529,
      "trave": 530,
      "enti": 531,
      "southward": 532,
      "entire": 533,
      "semantics": 534,
      "##ri": 535,
      "change": 536,
      "bet": 537,
      "rep": 538,
      "##een": 539,
      "##ween": 540,
      "between": 541,
      "##al": 542,
      "take": 543,
      "continu": 544,
      "si": 545,
      "##rese": 546,
      "##nted": 547,
      "represe": 548,
      "represented": 549,
      "continuing": 550,
      "steps": 551,
      "##tuated": 552,
      "situated": 553,
      "moveme": 554,
      "movement": 555,
      "##way": 556,
      "away": 557,
      "following": 558,
      "##cri": 559,
      "##bed": 560,
      "descri": 561,
      "described": 562,
      ").": 563,
      "dur": 564,
      "##and": 565,
      "descend": 566,
      "will": 567,
      "crossing": 568,
      "ed": 569,
      "edge": 570,
      "travel": 571,
      "or": 572,
      "##tion": 573,
      "motion": 574,
      "ac": 575,
      "##own": 576,
      "within": 577,
      "across": 578,
      "duration": 579,
      "down": 580,
      "sm": 581,
      "##lf": 582,
      "northward": 583,
      "small": 584,
      "sig": 585,
      "##nific": 586,
      "##igin": 587,
      "origin": 588,
      "signific": 589,
      "significant": 590,
      "westward": 591,
      "colors": 592,
      "positioned": 593,
      "ce": 594,
      "##self": 595,
      "##so": 596,
      "location": 597,
      "also": 598,
      "center": 599,
      "stand": 600,
      "itself": 601,
      "pro": 602,
      "way": 603,
      "ple": 604,
      "##ase": 605,
      "please": 606,
      "##ut": 607,
      "##nsition": 608,
      "southwards": 609,
      "transition": 610,
      "turns": 611,
      "original": 612,
      "passes": 613,
      "but": 614,
      "##abinet": 615,
      "##cabinet": 616,
      "##_cabinet": 617,
      "##ary": 618,
      "file_cabinet": 619,
      "##gre": 620,
      "points": 621,
      "progre": 622,
      "progress": 623,
      "##der": 624,
      "new": 625,
      "path": 626,
      "##ag": 627,
      "progresses": 628,
      "remainder": 629,
      "ascend": 630,
      "positions": 631,
      "me": 632,
      "##onally": 633,
      "diag": 634,
      "walking": 635,
      "diagonally": 636,
      "##dually": 637,
      "your": 638,
      "##ern": 639,
      "gradually": 640,
      "##ging": 641,
      "more": 642,
      "##nging": 643,
      "changing": 644,
      "turning": 645,
      "##imb": 646,
      "returns": 647,
      "climb": 648,
      "re": 649,
      "##ling": 650,
      "moved": 651,
      "remaining": 652,
      "enters": 653,
      "allow": 654,
      "grey": 655,
      "changes": 656,
      "allows": 657,
      "##iving": 658,
      "##ral": 659,
      "arriving": 660,
      "un": 661,
      "##lar": 662,
      "stra": 663,
      "##our": 664,
      "straight": 665,
      "ove": 666,
      "##ine": 667,
      "being": 668,
      "over": 669,
      "diction": 670,
      "dictionary": 671,
      "last": 672,
      "line": 673,
      "northwards": 674,
      "entering": 675,
      "unit": 676,
      "49": 677,
      "##ift": 678,
      "##ular": 679,
      "shift": 680,
      "units": 681,
      "10": 682,
      "38": 683,
      "westwards": 684,
      "##ett": 685,
      "circular": 686,
      "bit": 687,
      "##ik": 688,
      "##lo": 689,
      "started": 690,
      "come": 691,
      "gu": 692,
      "mid": 693,
      "##ace": 694,
      "##dle": 695,
      "##ntion": 696,
      "follows": 697,
      "circling": 698,
      "upwards": 699,
      "mention": 700,
      "middle": 701,
      "mentioned": 702,
      "se": 703,
      "looping": 704,
      "##gion": 705,
      "throughout": 706,
      "traver": 707,
      "region": 708,
      "other": 709,
      "##as": 710,
      "off": 711,
      "ex": 712,
      "sett": 713,
      "##veral": 714,
      "##ity": 715,
      "guide": 716,
      "several": 717,
      "flo": 718,
      "get": 719,
      "lat": 720,
      "pat": 721,
      "##am": 722,
      "##tern": 723,
      "##pp": 724,
      "floor": 725,
      "later": 726,
      "com": 727,
      "##mation": 728,
      "##for": 729,
      "areas": 730,
      "infor": 731,
      "traverse": 732,
      "information": 733,
      "det": 734,
      "transitions": 735,
      "detour": 736,
      "all": 737,
      "cou": 738,
      "wall": 739,
      "##ia": 740,
      "##ond": 741,
      "one": 742,
      "ones": 743,
      "pattern": 744,
      "far": 745,
      "pl": 746,
      "sit": 747,
      "sec": 748,
      "##ina": 749,
      "second": 750,
      "cur": 751,
      "land": 752,
      "##intain": 753,
      "when": 754,
      "maintain": 755,
      "not": 756,
      "transitioning": 757,
      "counter": 758,
      "place": 759,
      "app": 760,
      "fu": 761,
      "vic": 762,
      "##ty": 763,
      "##king": 764,
      "##inity": 765,
      "final": 766,
      "gene": 767,
      "stayed": 768,
      "circles": 769,
      "##ively": 770,
      "vicinity": 771,
      "ad": 772,
      "specifically": 773,
      "13": 774,
      "11": 775,
      "55": 776,
      "reached": 777,
      "av": 778,
      "##oid": 779,
      "##ous": 780,
      "station": 781,
      "afterwards": 782,
      "making": 783,
      "maintained": 784,
      "avoid": 785,
      "stationary": 786,
      "avoiding": 787,
      "14": 788,
      "17": 789,
      "23": 790,
      "33": 791,
      "31": 792,
      "30": 793,
      "41": 794,
      "su": 795,
      "##mp": 796,
      "inc": 797,
      "crosses": 798,
      "19": 799,
      "16": 800,
      "12": 801,
      "54": 802,
      "emp": 803,
      "res": 804,
      "##ach": 805,
      "##ious": 806,
      "##ole": 807,
      "##pect": 808,
      "##nder": 809,
      "##ates": 810,
      "empty": 811,
      "respect": 812,
      "respectively": 813,
      "29": 814,
      "27": 815,
      "34": 816,
      "##din": 817,
      "##ordin": 818,
      "coordin": 819,
      "lastly": 820,
      "general": 821,
      "coordinates": 822,
      "22": 823,
      "37": 824,
      "do": 825,
      "fir": 826,
      "##plet": 827,
      "most": 828,
      "wander": 829,
      "exam": 830,
      "settling": 831,
      "complet": 832,
      "first": 833,
      "example": 834,
      "15": 835,
      "de": 836,
      "tw": 837,
      "##reas": 838,
      "init": 839,
      "##ance": 840,
      "##iko": 841,
      "settle": 842,
      "##reasing": 843,
      "initi": 844,
      ",!": 845,
      "18": 846,
      "26": 847,
      "52": 848,
      "dest": 849,
      "sur": 850,
      "var": 851,
      "##ser": 852,
      "##ination": 853,
      "closer": 854,
      "##roach": 855,
      "begins": 856,
      "arrives": 857,
      "approach": 858,
      "full": 859,
      "increasing": 860,
      "mostly": 861,
      "dev": 862,
      "initial": 863,
      "destination": 864,
      "25": 865,
      "21": 866,
      "43": 867,
      "47": 868,
      "50": 869,
      "has": 870,
      "kitch": 871,
      "os": 872,
      "##rent": 873,
      "find": 874,
      "##rounded": 875,
      "during": 876,
      "downwards": 877,
      "##ika": 878,
      "current": 879,
      "two": 880,
      "surrounded": 881,
      "devika": 882,
      "kitchen": 883,
      "osc": 884,
      "53": 885,
      "60": 886,
      "##ab": 887,
      "##ey": 888,
      "##que": 889,
      "##stance": 890,
      "eastern": 891,
      "forward": 892,
      "distance": 893,
      "keeping": 894,
      "movements": 895,
      "locations": 896,
      "74": 897,
      "est": 898,
      "ha": 899,
      "jour": 900,
      "ol": 901,
      "pre": 902,
      "till": 903,
      "##able": 904,
      "##ied": 905,
      "##min": 906,
      "##ney": 907,
      "##ga": 908,
      "##eb": 909,
      "##li": 910,
      "##dmin": 911,
      "##bse": 912,
      "##ating": 913,
      "padmin": 914,
      "whole": 915,
      "##ified": 916,
      "specified": 917,
      "##rie": 918,
      "shifting": 919,
      "seconds": 920,
      "subse": 921,
      "complete": 922,
      "##quent": 923,
      "esteb": 924,
      "have": 925,
      "journey": 926,
      "olga": 927,
      "padmini": 928,
      "subsequent": 929,
      "esteban": 930,
      "51": 931,
      "65": 932,
      "forth": 933,
      "hina": 934,
      "sim": 935,
      "##miko": 936,
      "##low": 937,
      "onwards": 938,
      "once": 939,
      "below": 940,
      "shifts": 941,
      "fumiko": 942,
      "112": 943,
      "various": 944,
      "oscar": 945,
      "subsequently": 946,
      "',": 947,
      "32": 948,
      "45": 949,
      "44": 950,
      "64": 951,
      "ab": 952,
      "dina": 953,
      "gab": 954,
      "ib": 955,
      "ind": 956,
      "jav": 957,
      "mu": 958,
      "part": 959,
      "ug": 960,
      "xia": 961,
      "##ad": 962,
      "##xim": 963,
      "##io": 964,
      "##ier": 965,
      "##ilar": 966,
      "##him": 967,
      "##cep": 968,
      "##lu": 969,
      "##lik": 970,
      "##pable": 971,
      "##van": 972,
      "##vious": 973,
      "capable": 974,
      "##rahim": 975,
      "paus": 976,
      "##ani": 977,
      "##ang": 978,
      "heads": 979,
      "ended": 980,
      "malik": 981,
      "excep": 982,
      "coming": 983,
      "curve": 984,
      "adam": 985,
      "does": 986,
      "previous": 987,
      "##riel": 988,
      "similar": 989,
      "dinah": 990,
      "gabriel": 991,
      "ibrahim": 992,
      "indic": 993,
      "javier": 994,
      "ugo": 995,
      "except": 996,
      "42": 997,
      "57": 998,
      "68": 999,
      "gett": 1000,
      "gio": 1001,
      "uri": 1002,
      "vi": 1003,
      "wo": 1004,
      "zig": 1005,
      "##ni": 1006,
      "##gang": 1007,
      "##os": 1008,
      "##lom": 1009,
      "thre": 1010,
      "them": 1011,
      "##ind": 1012,
      "##ark": 1013,
      "##ori": 1014,
      "##ides": 1015,
      "solom": 1016,
      "times": 1017,
      "northeastward": 1018,
      "leo": 1019,
      "##lfgang": 1020,
      "reina": 1021,
      "337": 1022,
      "##olet": 1023,
      "##lud": 1024,
      "##vanni": 1025,
      "pause": 1026,
      "getting": 1027,
      "giovanni": 1028,
      "violet": 1029,
      "wolfgang": 1030,
      "three": 1031,
      "solomon": 1032,
      "260": 1033,
      "63": 1034,
      "69": 1035,
      "62": 1036,
      "61": 1037,
      "73": 1038,
      "71": 1039,
      "70": 1040,
      "87": 1041,
      "],": 1042,
      "four": 1043,
      "here": 1044,
      "ming": 1045,
      "main": 1046,
      "mome": 1047,
      "mark": 1048,
      "opp": 1049,
      "tia": 1050,
      "vary": 1051,
      "xim": 1052,
      "##ah": 1053,
      "##gori": 1054,
      "##eat": 1055,
      "##ell": 1056,
      "##clo": 1057,
      "##lat": 1058,
      "##sal": 1059,
      "##zag": 1060,
      "thal": 1061,
      "##thm": 1062,
      "##ort": 1063,
      "##lla": 1064,
      "##lly": 1065,
      "##rally": 1066,
      "##erly": 1067,
      "##ena": 1068,
      "##ice": 1069,
      "##sse": 1070,
      "bella": 1071,
      "afterward": 1072,
      "northwestward": 1073,
      "rosal": 1074,
      "space": 1075,
      "algori": 1076,
      "short": 1077,
      "##ations": 1078,
      "switching": 1079,
      "repeat": 1080,
      "prov": 1081,
      "proxim": 1082,
      "relat": 1083,
      "counterclo": 1084,
      "appli": 1085,
      "generally": 1086,
      "559": 1087,
      "235": 1088,
      "much": 1089,
      "zigzag": 1090,
      "##osite": 1091,
      "moment": 1092,
      "marked": 1093,
      "opposite": 1094,
      "ximena": 1095,
      "thalia": 1096,
      "rosalind": 1097,
      "algorithm": 1098,
      "proximity": 1099,
      "counterclockwise": 1100,
      "35": 1101,
      "36": 1102,
      "48": 1103,
      "56": 1104,
      "72": 1105,
      "85": 1106,
      "ch": 1107,
      "im": 1108,
      "lar": 1109,
      "lea": 1110,
      "min": 1111,
      "na": 1112,
      "rad": 1113,
      "sam": 1114,
      "ve": 1115,
      "win": 1116,
      "well": 1117,
      "##ius": 1118,
      "##iations": 1119,
      "##nce": 1120,
      "##nown": 1121,
      "##oint": 1122,
      "##dition": 1123,
      "##point": 1124,
      "##known": 1125,
      "##ze": 1126,
      "thir": 1127,
      "##ston": 1128,
      "##les": 1129,
      "##arp": 1130,
      "##arles": 1131,
      "##ger": 1132,
      "##uel": 1133,
      "##omi": 1134,
      "southwestward": 1135,
      "was": 1136,
      "keiko": 1137,
      "proceeds": 1138,
      "alway": 1139,
      "sharp": 1140,
      "entirety": 1141,
      "size": 1142,
      "significantly": 1143,
      "unknown": 1144,
      "109": 1145,
      "101": 1146,
      "addition": 1147,
      "sure": 1148,
      "includ": 1149,
      "198": 1150,
      "161": 1151,
      "completing": 1152,
      "indicated": 1153,
      "mainly": 1154,
      "relatively": 1155,
      "moments": 1156,
      "charles": 1157,
      "imani": 1158,
      "naomi": 1159,
      "radius": 1160,
      "samuel": 1161,
      "winston": 1162,
      "third": 1163,
      "always": 1164,
      "additional": 1165,
      "'?": 1166,
      "59": 1167,
      "67": 1168,
      "75": 1169,
      "83": 1170,
      "could": 1171,
      "each": 1172,
      "lu": 1173,
      "man": 1174,
      "vis": 1175,
      "zon": 1176,
      "##nc": 1177,
      "##cia": 1178,
      "##tra": 1179,
      "##rice": 1180,
      "##jace": 1181,
      "toward": 1182,
      "##ound": 1183,
      "##ided": 1184,
      "northern": 1185,
      "##atrice": 1186,
      "##lling": 1187,
      "yousse": 1188,
      "##eter": 1189,
      "trace": 1190,
      "beatrice": 1191,
      "backtra": 1192,
      "##iting": 1193,
      "northwestern": 1194,
      "keeps": 1195,
      "arc": 1196,
      "243": 1197,
      "travelling": 1198,
      "edges": 1199,
      "refere": 1200,
      "104": 1201,
      "102": 1202,
      "guides": 1203,
      "travers": 1204,
      "adjace": 1205,
      "317": 1206,
      "306": 1207,
      "544": 1208,
      "settles": 1209,
      "variations": 1210,
      "above": 1211,
      "about": 1212,
      "provided": 1213,
      "applies": 1214,
      "leaving": 1215,
      "minor": 1216,
      "veer": 1217,
      "lucia": 1218,
      "manner": 1219,
      "zone": 1220,
      "youssef": 1221,
      "backtrack": 1222,
      "adjacent": 1223,
      "46": 1224,
      "58": 1225,
      "66": 1226,
      "79": 1227,
      "77": 1228,
      "76": 1229,
      "84": 1230,
      "86": 1231,
      "94": 1232,
      "97": 1233,
      "91": 1234,
      "]?": 1235,
      "cove": 1236,
      "eli": 1237,
      "ground": 1238,
      "hove": 1239,
      "ju": 1240,
      "kha": 1241,
      "lit": 1242,
      "per": 1243,
      "qad": 1244,
      "sides": 1245,
      "vani": 1246,
      "zar": 1247,
      "##ily": 1248,
      "##mo": 1249,
      "##um": 1250,
      "##ear": 1251,
      "##end": 1252,
      "##ces": 1253,
      "##lt": 1254,
      "##lid": 1255,
      "##tle": 1256,
      "##ting": 1257,
      "##ry": 1258,
      "##per": 1259,
      "##vance": 1260,
      "##jah": 1261,
      "they": 1262,
      "stead": 1263,
      "need": 1264,
      "##red": 1265,
      "##eath": 1266,
      "##gher": 1267,
      "##ited": 1268,
      "##imeter": 1269,
      "higher": 1270,
      "northeastern": 1271,
      "southeastward": 1272,
      "##illating": 1273,
      "upper": 1274,
      "began": 1275,
      "key": 1276,
      "spend": 1277,
      "noor": 1278,
      "altern": 1279,
      "finishing": 1280,
      "205": 1281,
      "392": 1282,
      "390": 1283,
      "285": 1284,
      "286": 1285,
      "282": 1286,
      "246": 1287,
      "stepping": 1288,
      "changed": 1289,
      "travels": 1290,
      "waypoint": 1291,
      "yourself": 1292,
      "103": 1293,
      "108": 1294,
      "105": 1295,
      "100": 1296,
      "388": 1297,
      "387": 1298,
      "382": 1299,
      "exp": 1300,
      "exiting": 1301,
      "patch": 1302,
      "farah": 1303,
      "maintaining": 1304,
      "appear": 1305,
      "advance": 1306,
      "113": 1307,
      "558": 1308,
      "142": 1309,
      "141": 1310,
      "318": 1311,
      "308": 1312,
      "412": 1313,
      "196": 1314,
      "123": 1315,
      "129": 1316,
      "295": 1317,
      "297": 1318,
      "276": 1319,
      "155": 1320,
      "186": 1321,
      "255": 1322,
      "oscillating": 1323,
      "539": 1324,
      "443": 1325,
      "indicating": 1326,
      "repeats": 1327,
      "larger": 1328,
      "includes": 1329,
      "visited": 1330,
      "reference": 1331,
      "traversing": 1332,
      "covered": 1333,
      "elijah": 1334,
      "hover": 1335,
      "khalid": 1336,
      "little": 1337,
      "perimeter": 1338,
      "qadir": 1339,
      "zara": 1340,
      "##most": 1341,
      "steadily": 1342,
      "waypoints": 1343
    }
  }
}