{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "'": 5,
      "(": 6,
      ")": 7,
      ",": 8,
      "-": 9,
      ".": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ";": 21,
      "[": 22,
      "]": 23,
      "_": 24,
      "a": 25,
      "b": 26,
      "c": 27,
      "d": 28,
      "e": 29,
      "f": 30,
      "g": 31,
      "h": 32,
      "i": 33,
      "j": 34,
      "k": 35,
      "l": 36,
      "m": 37,
      "n": 38,
      "o": 39,
      "p": 40,
      "q": 41,
      "r": 42,
      "s": 43,
      "t": 44,
      "u": 45,
      "v": 46,
      "w": 47,
      "x": 48,
      "y": 49,
      "z": 50,
      "’": 51,
      "##t": 52,
      "##a": 53,
      "##r": 54,
      "##9": 55,
      "##u": 56,
      "##i": 57,
      "##n": 58,
      "##g": 59,
      "##o": 60,
      "##h": 61,
      "##w": 62,
      "##e": 63,
      "##s": 64,
      "##c": 65,
      "##d": 66,
      "##v": 67,
      "##l": 68,
      "##y": 69,
      "##m": 70,
      "##p": 71,
      "##6": 72,
      "##4": 73,
      "##3": 74,
      "##b": 75,
      "##z": 76,
      "##k": 77,
      "##0": 78,
      "##2": 79,
      "##5": 80,
      "##7": 81,
      "##8": 82,
      "##1": 83,
      "##x": 84,
      "##j": 85,
      "##_": 86,
      "##f": 87,
      "##.": 88,
      "##q": 89,
      "##,": 90,
      "##he": 91,
      "the": 92,
      "##le": 93,
      "to": 94,
      "##ile": 95,
      "##st": 96,
      "##in": 97,
      "tile": 98,
      "##th": 99,
      "##ve": 100,
      "##ar": 101,
      "##ove": 102,
      "st": 103,
      "##nd": 104,
      "then": 105,
      "move": 106,
      "and": 107,
      "##ast": 108,
      "##ou": 109,
      "##or": 110,
      "east": 111,
      "##ge": 112,
      "fr": 113,
      "ne": 114,
      "near": 115,
      "##id": 116,
      "frid": 117,
      "fridge": 118,
      "sou": 119,
      "tiles": 120,
      "nor": 121,
      "south": 122,
      "on": 123,
      "##est": 124,
      "north": 125,
      "of": 126,
      "##ea": 127,
      "west": 128,
      "##ink": 129,
      "pink": 130,
      "##ra": 131,
      "##ll": 132,
      "stove": 133,
      "##ir": 134,
      "##nt": 135,
      "##art": 136,
      "start": 137,
      "##tu": 138,
      "##war": 139,
      "##ward": 140,
      "ba": 141,
      "##wards": 142,
      "##ha": 143,
      "ar": 144,
      "cha": 145,
      "towards": 146,
      "chair": 147,
      "##ing": 148,
      "##ab": 149,
      "gra": 150,
      "gray": 151,
      "##ow": 152,
      "##llow": 153,
      "##ed": 154,
      "sta": 155,
      "ye": 156,
      "yellow": 157,
      "##all": 158,
      "fin": 159,
      "area": 160,
      "##ally": 161,
      "##ue": 162,
      "finally": 163,
      "##ur": 164,
      "##ch": 165,
      "##ck": 166,
      "##et": 167,
      "rea": 168,
      "bath": 169,
      "##tub": 170,
      "bathtub": 171,
      "reach": 172,
      "back": 173,
      "co": 174,
      "##inet": 175,
      "##abinet": 176,
      "##ead": 177,
      "head": 178,
      "cabinet": 179,
      "##il": 180,
      "red": 181,
      "unt": 182,
      "until": 183,
      "cont": 184,
      "contin": 185,
      "continue": 186,
      "##re": 187,
      "##ss": 188,
      "stay": 189,
      "you": 190,
      "##nge": 191,
      "go": 192,
      "in": 193,
      "pa": 194,
      "##urn": 195,
      "turn": 196,
      "ora": 197,
      "orange": 198,
      "pass": 199,
      "tab": 200,
      "table": 201,
      "##ec": 202,
      "##tue": 203,
      "statue": 204,
      "##ect": 205,
      "##en": 206,
      "at": 207,
      "gre": 208,
      "green": 209,
      "##irc": 210,
      "circ": 211,
      "by": 212,
      "##er": 213,
      "wh": 214,
      "##it": 215,
      "circle": 216,
      "passing": 217,
      "##gh": 218,
      "##ject": 219,
      "re": 220,
      "##ain": 221,
      "tra": 222,
      "##om": 223,
      "##to": 224,
      "onto": 225,
      "end": 226,
      "##the": 227,
      "##ory": 228,
      "##jectory": 229,
      "trajectory": 230,
      "##ound": 231,
      "around": 232,
      "for": 233,
      "##igh": 234,
      "##ight": 235,
      "tiled": 236,
      "##an": 237,
      "be": 238,
      "bed": 239,
      "fan": 240,
      "ag": 241,
      "again": 242,
      "it": 243,
      "##rn": 244,
      "##ite": 245,
      "##turn": 246,
      "return": 247,
      "white": 248,
      "##lue": 249,
      "blue": 250,
      "##on": 251,
      "##me": 252,
      "po": 253,
      "##west": 254,
      "right": 255,
      "an": 256,
      "so": 257,
      "##fa": 258,
      "sofa": 259,
      "##ple": 260,
      "##theast": 261,
      "pur": 262,
      "purple": 263,
      "sa": 264,
      "same": 265,
      "from": 266,
      "starting": 267,
      "##ner": 268,
      "##int": 269,
      "cor": 270,
      "point": 271,
      "corner": 272,
      "##ion": 273,
      "##ep": 274,
      "##se": 275,
      "there": 276,
      "##ro": 277,
      "##ore": 278,
      "cl": 279,
      "##fore": 280,
      "before": 281,
      "##ft": 282,
      "wi": 283,
      "clo": 284,
      "##gin": 285,
      "with": 286,
      "##ce": 287,
      "##op": 288,
      "moves": 289,
      "##al": 290,
      "file": 291,
      "##ac": 292,
      "cac": 293,
      "##tus": 294,
      "cactus": 295,
      "northwest": 296,
      "up": 297,
      "ro": 298,
      "room": 299,
      "ent": 300,
      "begin": 301,
      "northeast": 302,
      "##ly": 303,
      "##ther": 304,
      "while": 305,
      "int": 306,
      "into": 307,
      "mo": 308,
      "th": 309,
      "wal": 310,
      "walk": 311,
      "sl": 312,
      "ke": 313,
      "keep": 314,
      "southwest": 315,
      "##ving": 316,
      "stop": 317,
      "heading": 318,
      "southeast": 319,
      "##main": 320,
      "remain": 321,
      "moving": 322,
      "##ross": 323,
      "##ough": 324,
      "##rough": 325,
      "through": 326,
      "close": 327,
      "fo": 328,
      "follow": 329,
      "enter": 330,
      "going": 331,
      "rest": 332,
      "##is": 333,
      "##ak": 334,
      "staying": 335,
      "##ri": 336,
      "pro": 337,
      "reaching": 338,
      "proce": 339,
      "proceed": 340,
      "##ection": 341,
      "##ake": 342,
      "dir": 343,
      "direction": 344,
      "fur": 345,
      "le": 346,
      "further": 347,
      "left": 348,
      "aft": 349,
      "after": 350,
      "ti": 351,
      "eastward": 352,
      "slight": 353,
      "##by": 354,
      "nearby": 355,
      "cross": 356,
      "no": 357,
      "ob": 358,
      "object": 359,
      "objects": 360,
      "##ise": 361,
      "##wise": 362,
      "##ckwise": 363,
      "slightly": 364,
      "##ot": 365,
      "##tion": 366,
      "clockwise": 367,
      "##eps": 368,
      "finis": 369,
      "finish": 370,
      "lo": 371,
      "tha": 372,
      "that": 373,
      "##ide": 374,
      "side": 375,
      "arri": 376,
      "##sit": 377,
      "##sition": 378,
      "eastwards": 379,
      "sp": 380,
      "##es": 381,
      "##cend": 382,
      "##ay": 383,
      "##lor": 384,
      "color": 385,
      "al": 386,
      "spot": 387,
      "past": 388,
      "##owly": 389,
      "slowly": 390,
      "ending": 391,
      "##mest": 392,
      "##ong": 393,
      "timest": 394,
      "arrive": 395,
      "along": 396,
      "position": 397,
      "loop": 398,
      "make": 399,
      "##other": 400,
      "another": 401,
      "entir": 402,
      "returning": 403,
      "sw": 404,
      "##itch": 405,
      "switch": 406,
      "),": 407,
      "starts": 408,
      "entire": 409,
      "top": 410,
      "trave": 411,
      "is": 412,
      "##xt": 413,
      "next": 414,
      "##ually": 415,
      "fe": 416,
      "take": 417,
      "few": 418,
      "steps": 419,
      "des": 420,
      "descend": 421,
      ").": 422,
      "travel": 423,
      "sq": 424,
      "whe": 425,
      "##uar": 426,
      "##way": 427,
      "squar": 428,
      "square": 429,
      "timesteps": 430,
      "du": 431,
      "##ration": 432,
      "duration": 433,
      "away": 434,
      "##ca": 435,
      "southward": 436,
      "ed": 437,
      "edge": 438,
      "dow": 439,
      "sm": 440,
      "down": 441,
      "small": 442,
      "bet": 443,
      "##we": 444,
      "betwe": 445,
      "between": 446,
      "as": 447,
      "ori": 448,
      "origin": 449,
      "ac": 450,
      "across": 451,
      "where": 452,
      "di": 453,
      "time": 454,
      "eve": 455,
      "##ntually": 456,
      "stand": 457,
      "eventually": 458,
      "this": 459,
      "##out": 460,
      "##nter": 461,
      "##ill": 462,
      "##ich": 463,
      "which": 464,
      "##che": 465,
      "colored": 466,
      "##cabinet": 467,
      "##_cabinet": 468,
      "change": 469,
      "file_cabinet": 470,
      "motion": 471,
      "original": 472,
      "##ping": 473,
      "still": 474,
      "##ome": 475,
      "way": 476,
      "##der": 477,
      "stopping": 478,
      "crossing": 479,
      "remainder": 480,
      "ascend": 481,
      "some": 482,
      "southwards": 483,
      "westward": 484,
      "reache": 485,
      "walking": 486,
      "##im": 487,
      "northward": 488,
      "your": 489,
      "##ag": 490,
      "ends": 491,
      "without": 492,
      "##ig": 493,
      "stays": 494,
      "bot": 495,
      "ce": 496,
      "##tom": 497,
      "##lf": 498,
      "##onally": 499,
      "##self": 500,
      "loca": 501,
      "timestep": 502,
      "diag": 503,
      "bottom": 504,
      "diagonally": 505,
      "grey": 506,
      "clim": 507,
      "center": 508,
      "climb": 509,
      "sh": 510,
      "##ling": 511,
      "itself": 512,
      "stra": 513,
      "straight": 514,
      "are": 515,
      "turning": 516,
      "sig": 517,
      "##if": 518,
      "##ica": 519,
      "##nif": 520,
      "reaches": 521,
      "signif": 522,
      "##icant": 523,
      "significant": 524,
      "ove": 525,
      "lin": 526,
      "over": 527,
      "un": 528,
      "step": 529,
      "its": 530,
      "line": 531,
      "unit": 532,
      "##and": 533,
      "##ul": 534,
      "units": 535,
      "age": 536,
      "##dually": 537,
      "gradually": 538,
      "##ular": 539,
      "agent": 540,
      "now": 541,
      "get": 542,
      "circular": 543,
      "followed": 544,
      "##lo": 545,
      "come": 546,
      "circling": 547,
      "any": 548,
      "20": 549,
      "##ift": 550,
      "westwards": 551,
      "stops": 552,
      "arriving": 553,
      "looping": 554,
      "shift": 555,
      "bit": 556,
      "##ace": 557,
      "##nsition": 558,
      "##gion": 559,
      "##our": 560,
      "region": 561,
      "transition": 562,
      "40": 563,
      "continues": 564,
      "##ging": 565,
      "##ern": 566,
      "##ted": 567,
      "##nging": 568,
      "##ere": 569,
      "changing": 570,
      "flo": 571,
      "located": 572,
      "floor": 573,
      "det": 574,
      "traver": 575,
      "detour": 576,
      "more": 577,
      "started": 578,
      "com": 579,
      "traverse": 580,
      "cou": 581,
      "mid": 582,
      "pl": 583,
      "sit": 584,
      "##dle": 585,
      "path": 586,
      "middle": 587,
      "set": 588,
      "##pp": 589,
      "northwards": 590,
      "counter": 591,
      "place": 592,
      "sett": 593,
      "49": 594,
      "last": 595,
      "other": 596,
      "##ond": 597,
      "off": 598,
      "goes": 599,
      "circles": 600,
      "far": 601,
      "se": 602,
      "sec": 603,
      "##ting": 604,
      "##60": 605,
      "##fere": 606,
      "##ral": 607,
      "location": 608,
      "second": 609,
      "land": 610,
      "ones": 611,
      "pat": 612,
      "will": 613,
      "upwards": 614,
      "##aking": 615,
      "colors": 616,
      "all": 617,
      "##tern": 618,
      "turns": 619,
      "making": 620,
      "##ffere": 621,
      "##veral": 622,
      "one": 623,
      "differe": 624,
      "several": 625,
      "different": 626,
      "app": 627,
      "##20": 628,
      "stayed": 629,
      "remaining": 630,
      "throughout": 631,
      "afterwards": 632,
      "pattern": 633,
      "bo": 634,
      "moved": 635,
      "##ance": 636,
      "entering": 637,
      "both": 638,
      "39": 639,
      "vi": 640,
      "wand": 641,
      "##ach": 642,
      "##sing": 643,
      "##nts": 644,
      "comple": 645,
      "wander": 646,
      "24": 647,
      "##ive": 648,
      "##cin": 649,
      "final": 650,
      "##ity": 651,
      "remains": 652,
      "when": 653,
      "reached": 654,
      "transitioning": 655,
      "lastly": 656,
      "vicin": 657,
      "##ively": 658,
      "vicinity": 659,
      "28": 660,
      "cur": 661,
      "fu": 662,
      "##rea": 663,
      "full": 664,
      "##reasing": 665,
      "13": 666,
      "10": 667,
      "kit": 668,
      "wall": 669,
      "##te": 670,
      "##ation": 671,
      "##sp": 672,
      "##ser": 673,
      "##creasing": 674,
      "find": 675,
      "continu": 676,
      "increasing": 677,
      "##ectively": 678,
      "resp": 679,
      "##roach": 680,
      "closer": 681,
      "##chen": 682,
      "settling": 683,
      "approach": 684,
      "kitchen": 685,
      "respectively": 686,
      "360": 687,
      "80": 688,
      "##mp": 689,
      "moveme": 690,
      "keeping": 691,
      "settle": 692,
      "399": 693,
      "240": 694,
      "160": 695,
      "emp": 696,
      "##ty": 697,
      "##ut": 698,
      "##ole": 699,
      "##stance": 700,
      "passes": 701,
      "whole": 702,
      "begins": 703,
      "till": 704,
      "downwards": 705,
      "distance": 706,
      "seconds": 707,
      "complete": 708,
      "continuing": 709,
      "movements": 710,
      "empty": 711,
      "120": 712,
      "dest": 713,
      "##ial": 714,
      "##ination": 715,
      "init": 716,
      "forth": 717,
      "within": 718,
      "280": 719,
      "destination": 720,
      "initial": 721,
      "14": 722,
      "320": 723,
      "ad": 724,
      "jou": 725,
      "##uch": 726,
      "##ey": 727,
      "##ary": 728,
      "station": 729,
      "pau": 730,
      "##rney": 731,
      "following": 732,
      "enters": 733,
      "shifting": 734,
      "coming": 735,
      "curve": 736,
      "journey": 737,
      "stationary": 738,
      "12": 739,
      "17": 740,
      "50": 741,
      "65": 742,
      "ex": 743,
      "##ad": 744,
      "##iz": 745,
      "##os": 746,
      "##so": 747,
      "them": 748,
      "eastern": 749,
      "new": 750,
      "heads": 751,
      "northeastward": 752,
      "most": 753,
      "also": 754,
      "getting": 755,
      "200": 756,
      "pause": 757,
      "15": 758,
      "34": 759,
      "but": 760,
      "mome": 761,
      "much": 762,
      "opp": 763,
      "tw": 764,
      "##as": 765,
      "##ating": 766,
      "##clo": 767,
      "##vi": 768,
      "##ous": 769,
      "##ort": 770,
      "once": 771,
      "##uring": 772,
      "points": 773,
      "follows": 774,
      "times": 775,
      "short": 776,
      "shifts": 777,
      "counterclo": 778,
      "##osite": 779,
      "mostly": 780,
      "opposite": 781,
      "two": 782,
      "counterclockwise": 783,
      "22": 784,
      "27": 785,
      "during": 786,
      "here": 787,
      "lar": 788,
      "min": 789,
      "main": 790,
      "pre": 791,
      "rad": 792,
      "siz": 793,
      "ve": 794,
      "##at": 795,
      "##round": 796,
      "##us": 797,
      "##ius": 798,
      "##arp": 799,
      "##over": 800,
      "areas": 801,
      "##ety": 802,
      "northwestward": 803,
      "not": 804,
      "entirety": 805,
      "switching": 806,
      "changes": 807,
      "sharp": 808,
      "completing": 809,
      "moments": 810,
      "##vious": 811,
      "large": 812,
      "previous": 813,
      "radius": 814,
      "size": 815,
      "11": 816,
      "26": 817,
      "33": 818,
      "30": 819,
      "37": 820,
      "31": 821,
      "45": 822,
      "64": 823,
      "74": 824,
      "87": 825,
      "fir": 826,
      "lea": 827,
      "ma": 828,
      "zon": 829,
      "zig": 830,
      "##tra": 831,
      "##nce": 832,
      "##gre": 833,
      "##vance": 834,
      "##zag": 835,
      "##jace": 836,
      "toward": 837,
      "onwards": 838,
      "##lling": 839,
      "##nti": 840,
      "arc": 841,
      "##eter": 842,
      "backtra": 843,
      "trace": 844,
      "ended": 845,
      "returns": 846,
      "progre": 847,
      "crosses": 848,
      "space": 849,
      "arrives": 850,
      "travelling": 851,
      "edges": 852,
      "significantly": 853,
      "advance": 854,
      "adjace": 855,
      "minor": 856,
      "veer": 857,
      "first": 858,
      "leaving": 859,
      "zone": 860,
      "zigzag": 861,
      "backtrack": 862,
      "progress": 863,
      "adjacent": 864,
      "23": 865,
      "25": 866,
      "35": 867,
      "38": 868,
      "59": 869,
      "56": 870,
      "62": 871,
      "73": 872,
      "71": 873,
      "86": 874,
      "do": 875,
      "each": 876,
      "four": 877,
      "gen": 878,
      "ground": 879,
      "hig": 880,
      "has": 881,
      "hover": 882,
      "ju": 883,
      "lit": 884,
      "os": 885,
      "part": 886,
      "per": 887,
      "##tle": 888,
      "##av": 889,
      "##um": 890,
      "##itu": 891,
      "##ear": 892,
      "##end": 893,
      "##cill": 894,
      "##pea": 895,
      "##per": 896,
      "##her": 897,
      "stead": 898,
      "##eath": 899,
      "##ily": 900,
      "##ree": 901,
      "##iting": 902,
      "refere": 903,
      "repea": 904,
      "upper": 905,
      "three": 906,
      "southwestward": 907,
      "southeastward": 908,
      "finishing": 909,
      "sides": 910,
      "spend": 911,
      "alway": 912,
      "##imeter": 913,
      "yourself": 914,
      "patch": 915,
      "appear": 916,
      "exp": 917,
      "exiting": 918,
      "mainly": 919,
      "larger": 920,
      "gene": 921,
      "higher": 922,
      "little": 923,
      "oscill": 924,
      "perimeter": 925,
      "##avig": 926,
      "steadily": 927,
      "reference": 928,
      "repeat": 929,
      "always": 930,
      "oscillating": 931
    }
  }
}