{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "/": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      ":": 24,
      ";": 25,
      "=": 26,
      "?": 27,
      "[": 28,
      "]": 29,
      "_": 30,
      "a": 31,
      "b": 32,
      "c": 33,
      "d": 34,
      "e": 35,
      "f": 36,
      "g": 37,
      "h": 38,
      "i": 39,
      "j": 40,
      "k": 41,
      "l": 42,
      "m": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "q": 47,
      "r": 48,
      "s": 49,
      "t": 50,
      "u": 51,
      "v": 52,
      "w": 53,
      "x": 54,
      "y": 55,
      "z": 56,
      "’": 57,
      "##9": 58,
      "##u": 59,
      "##r": 60,
      "##o": 61,
      "##n": 62,
      "##d": 63,
      "##e": 64,
      "##a": 65,
      "##i": 66,
      "##t": 67,
      "##g": 68,
      "##w": 69,
      "##s": 70,
      "##4": 71,
      "##6": 72,
      "##l": 73,
      "##h": 74,
      "##v": 75,
      "##c": 76,
      "##7": 77,
      "##0": 78,
      "##k": 79,
      "##y": 80,
      "##m": 81,
      "##5": 82,
      "##8": 83,
      "##x": 84,
      "##3": 85,
      "##1": 86,
      "##2": 87,
      "##p": 88,
      "##q": 89,
      "##z": 90,
      "##?": 91,
      "##f": 92,
      "##b": 93,
      "##,": 94,
      "##!": 95,
      "##.": 96,
      "##j": 97,
      "##_": 98,
      "th": 99,
      "the": 100,
      "to": 101,
      "##st": 102,
      "##th": 103,
      "##in": 104,
      "##le": 105,
      "##ve": 106,
      "of": 107,
      "##ove": 108,
      "st": 109,
      "##ile": 110,
      "##ar": 111,
      "##or": 112,
      "tile": 113,
      "then": 114,
      "##ou": 115,
      "##nd": 116,
      "fr": 117,
      "##ge": 118,
      "##ast": 119,
      "and": 120,
      "east": 121,
      "##id": 122,
      "frid": 123,
      "fridge": 124,
      "##orth": 125,
      "north": 126,
      "##est": 127,
      "move": 128,
      "ne": 129,
      "##at": 130,
      "near": 131,
      "sou": 132,
      "south": 133,
      "ca": 134,
      "west": 135,
      "##ll": 136,
      "stove": 137,
      "##ra": 138,
      "on": 139,
      "tiles": 140,
      "##ink": 141,
      "pink": 142,
      "##re": 143,
      "##ing": 144,
      "##ir": 145,
      "po": 146,
      "can": 147,
      "##ha": 148,
      "cha": 149,
      "go": 150,
      "re": 151,
      "chair": 152,
      "you": 153,
      "##ue": 154,
      "##ow": 155,
      "##nt": 156,
      "##er": 157,
      "##art": 158,
      "start": 159,
      "##llow": 160,
      "ba": 161,
      "##ct": 162,
      "that": 163,
      "##en": 164,
      "##ate": 165,
      "##et": 166,
      "##all": 167,
      "##bin": 168,
      "##binet": 169,
      "##ally": 170,
      "cabinet": 171,
      "fin": 172,
      "##om": 173,
      "finally": 174,
      "##ic": 175,
      "##war": 176,
      "##ward": 177,
      "##ect": 178,
      "##ject": 179,
      "ye": 180,
      "yellow": 181,
      "##wards": 182,
      "##tu": 183,
      "tra": 184,
      "gra": 185,
      "##lic": 186,
      "polic": 187,
      "gray": 188,
      "policy": 189,
      "##ory": 190,
      "##jectory": 191,
      "trajectory": 192,
      "from": 193,
      "be": 194,
      "towards": 195,
      "are": 196,
      "area": 197,
      "co": 198,
      "##ble": 199,
      "bath": 200,
      "##tub": 201,
      "bathtub": 202,
      "gen": 203,
      "##erate": 204,
      "generate": 205,
      "it": 206,
      "##op": 207,
      "moves": 208,
      "red": 209,
      "stop": 210,
      "##ss": 211,
      "stat": 212,
      "statue": 213,
      "##ur": 214,
      "##gh": 215,
      "##rou": 216,
      "pa": 217,
      "##ore": 218,
      "##ch": 219,
      "pass": 220,
      "##int": 221,
      "point": 222,
      "##ach": 223,
      "reach": 224,
      "in": 225,
      "ta": 226,
      "##ck": 227,
      "at": 228,
      "table": 229,
      "cont": 230,
      "contin": 231,
      "passing": 232,
      "##es": 233,
      "is": 234,
      "back": 235,
      "continue": 236,
      "##nti": 237,
      "##nge": 238,
      "unti": 239,
      "until": 240,
      "ora": 241,
      "orange": 242,
      "##it": 243,
      "wh": 244,
      "##ay": 245,
      "throu": 246,
      "through": 247,
      "gre": 248,
      "##an": 249,
      "green": 250,
      "fan": 251,
      "##east": 252,
      "##ea": 253,
      "stay": 254,
      "##ead": 255,
      "head": 256,
      "##fore": 257,
      "before": 258,
      "##west": 259,
      "fo": 260,
      "follow": 261,
      "going": 262,
      "bed": 263,
      "##on": 264,
      "so": 265,
      "##fa": 266,
      "sofa": 267,
      "starts": 268,
      "##urn": 269,
      "turn": 270,
      "goes": 271,
      "by": 272,
      "##ion": 273,
      "end": 274,
      "##ping": 275,
      "stopping": 276,
      "##ain": 277,
      "##ep": 278,
      "##me": 279,
      "hi": 280,
      "an": 281,
      "##ft": 282,
      "ti": 283,
      "col": 284,
      "##lue": 285,
      "blue": 286,
      "able": 287,
      "##irc": 288,
      "circ": 289,
      "northeast": 290,
      "file": 291,
      "cre": 292,
      "create": 293,
      "circle": 294,
      "##to": 295,
      "onto": 296,
      "for": 297,
      "ag": 298,
      "again": 299,
      "##ke": 300,
      "##ple": 301,
      "aft": 302,
      "after": 303,
      "tiled": 304,
      "pur": 305,
      "purple": 306,
      "##ite": 307,
      "white": 308,
      "tim": 309,
      "##ame": 310,
      "northwest": 311,
      "##estep": 312,
      "timestep": 313,
      "##ored": 314,
      "colored": 315,
      "ma": 316,
      "wi": 317,
      "##igh": 318,
      "##ight": 319,
      "##ition": 320,
      "##sition": 321,
      "southwest": 322,
      "make": 323,
      "##us": 324,
      "cact": 325,
      "##round": 326,
      "cactus": 327,
      "around": 328,
      "position": 329,
      "with": 330,
      "southeast": 331,
      "##rn": 332,
      "retu": 333,
      "return": 334,
      "##oc": 335,
      "##ed": 336,
      "##se": 337,
      "same": 338,
      "stops": 339,
      "##ner": 340,
      "cor": 341,
      "corner": 342,
      "##ill": 343,
      "still": 344,
      "##ther": 345,
      "there": 346,
      "right": 347,
      "##ig": 348,
      "starting": 349,
      "mo": 350,
      "wa": 351,
      "while": 352,
      "##ving": 353,
      "up": 354,
      "cl": 355,
      "##ated": 356,
      "loc": 357,
      "di": 358,
      "ro": 359,
      "moving": 360,
      "room": 361,
      "clo": 362,
      "##av": 363,
      "##avig": 364,
      "navig": 365,
      "navigate": 366,
      "##ich": 367,
      "which": 368,
      "ends": 369,
      "located": 370,
      "##ly": 371,
      "##main": 372,
      "remain": 373,
      "reaches": 374,
      "continues": 375,
      "##xt": 376,
      "next": 377,
      "ob": 378,
      "object": 379,
      "sl": 380,
      "##nter": 381,
      "##ro": 382,
      "##ive": 383,
      "##ome": 384,
      "reaching": 385,
      "beg": 386,
      "##is": 387,
      "begin": 388,
      "fur": 389,
      "further": 390,
      "some": 391,
      "##ction": 392,
      "int": 393,
      "into": 394,
      "##other": 395,
      "another": 396,
      "color": 397,
      "staying": 398,
      "ke": 399,
      "close": 400,
      "age": 401,
      "agent": 402,
      "##lk": 403,
      "walk": 404,
      "time": 405,
      "##ross": 406,
      "keep": 407,
      "eastward": 408,
      "##rection": 409,
      "direction": 410,
      "enter": 411,
      "##ere": 412,
      "le": 413,
      "top": 414,
      "heading": 415,
      "left": 416,
      "##ot": 417,
      "slight": 418,
      "want": 419,
      "sp": 420,
      "no": 421,
      "my": 422,
      "name": 423,
      "rest": 424,
      "slightly": 425,
      "##tw": 426,
      "##ork": 427,
      "netw": 428,
      "network": 429,
      "pr": 430,
      "##oce": 431,
      "proce": 432,
      "proceed": 433,
      "##by": 434,
      "nearby": 435,
      "timesteps": 436,
      "objects": 437,
      "give": 438,
      "given": 439,
      "cross": 440,
      "al": 441,
      "ending": 442,
      "##ually": 443,
      "##ce": 444,
      "sh": 445,
      "##60": 446,
      "##ide": 447,
      "sq": 448,
      "##uar": 449,
      "squar": 450,
      "##if": 451,
      "square": 452,
      "##20": 453,
      "eastwards": 454,
      "##ific": 455,
      "##ise": 456,
      "##wise": 457,
      "this": 458,
      "##ckwise": 459,
      "ar": 460,
      "stays": 461,
      "##ation": 462,
      "clockwise": 463,
      "remains": 464,
      "finis": 465,
      "arr": 466,
      "finish": 467,
      "des": 468,
      "followed": 469,
      "side": 470,
      "##out": 471,
      "##ld": 472,
      "##ould": 473,
      "eve": 474,
      "should": 475,
      "where": 476,
      "event": 477,
      "eventually": 478,
      "##ant": 479,
      "as": 480,
      "now": 481,
      "##ong": 482,
      "along": 483,
      "step": 484,
      "##cend": 485,
      "20": 486,
      "##ec": 487,
      "bo": 488,
      "both": 489,
      "##fere": 490,
      "spot": 491,
      "without": 492,
      "its": 493,
      "arrive": 494,
      "##ffere": 495,
      "differe": 496,
      "different": 497,
      "39": 498,
      "40": 499,
      "##itch": 500,
      "past": 501,
      "##owly": 502,
      "slowly": 503,
      "any": 504,
      "),": 505,
      "bot": 506,
      "##tom": 507,
      "returning": 508,
      "bottom": 509,
      "fe": 510,
      "lo": 511,
      "few": 512,
      "sw": 513,
      "loop": 514,
      "switch": 515,
      "28": 516,
      "24": 517,
      "spec": 518,
      "trave": 519,
      "enti": 520,
      "southward": 521,
      "entire": 522,
      "399": 523,
      "bet": 524,
      "##een": 525,
      "##ween": 526,
      "specific": 527,
      "between": 528,
      "se": 529,
      "change": 530,
      "##al": 531,
      "take": 532,
      "280": 533,
      "##ri": 534,
      "steps": 535,
      "200": 536,
      "240": 537,
      "360": 538,
      "##way": 539,
      "320": 540,
      "following": 541,
      "moveme": 542,
      "rep": 543,
      "continu": 544,
      "movement": 545,
      "160": 546,
      "80": 547,
      "continuing": 548,
      "away": 549,
      "##rese": 550,
      "##nted": 551,
      "represe": 552,
      "represented": 553,
      ").": 554,
      "dur": 555,
      "##and": 556,
      "descend": 557,
      "120": 558,
      "si": 559,
      "will": 560,
      "crossing": 561,
      "ed": 562,
      "edge": 563,
      "travel": 564,
      "or": 565,
      "##cri": 566,
      "##bed": 567,
      "descri": 568,
      "described": 569,
      "##tion": 570,
      "motion": 571,
      "ac": 572,
      "##own": 573,
      "within": 574,
      "across": 575,
      "duration": 576,
      "sem": 577,
      "##antic": 578,
      "semantic": 579,
      "down": 580,
      "sm": 581,
      "northward": 582,
      "small": 583,
      "##lf": 584,
      "##tuated": 585,
      "##igin": 586,
      "situated": 587,
      "origin": 588,
      "sig": 589,
      "##nific": 590,
      "westward": 591,
      "colors": 592,
      "signific": 593,
      "significant": 594,
      "ce": 595,
      "semantics": 596,
      "##self": 597,
      "center": 598,
      "location": 599,
      "stand": 600,
      "itself": 601,
      "way": 602,
      "ple": 603,
      "##ase": 604,
      "##so": 605,
      "also": 606,
      "please": 607,
      "##im": 608,
      "pro": 609,
      "##nsition": 610,
      "southwards": 611,
      "transition": 612,
      "turns": 613,
      "original": 614,
      "passes": 615,
      "##abinet": 616,
      "##cabinet": 617,
      "##_cabinet": 618,
      "file_cabinet": 619,
      "##gre": 620,
      "points": 621,
      "positioned": 622,
      "progre": 623,
      "progress": 624,
      "##ary": 625,
      "##der": 626,
      "new": 627,
      "progresses": 628,
      "remainder": 629,
      "ascend": 630,
      "path": 631,
      "##ag": 632,
      "positions": 633,
      "walking": 634,
      "##dually": 635,
      "your": 636,
      "##ern": 637,
      "gradually": 638,
      "more": 639,
      "##ging": 640,
      "turning": 641,
      "##nging": 642,
      "changing": 643,
      "##onally": 644,
      "clim": 645,
      "diag": 646,
      "climb": 647,
      "diagonally": 648,
      "##ling": 649,
      "moved": 650,
      "enters": 651,
      "allow": 652,
      "grey": 653,
      "allows": 654,
      "##iving": 655,
      "##ral": 656,
      "remaining": 657,
      "arriving": 658,
      "changes": 659,
      "un": 660,
      "##ut": 661,
      "stra": 662,
      "straight": 663,
      "me": 664,
      "##lar": 665,
      "returns": 666,
      "ove": 667,
      "##ine": 668,
      "but": 669,
      "over": 670,
      "diction": 671,
      "dictionary": 672,
      "line": 673,
      "northwards": 674,
      "entering": 675,
      "last": 676,
      "unit": 677,
      "49": 678,
      "##ular": 679,
      "##ift": 680,
      "shift": 681,
      "units": 682,
      "10": 683,
      "38": 684,
      "westwards": 685,
      "##ett": 686,
      "##our": 687,
      "circular": 688,
      "bit": 689,
      "##ik": 690,
      "##lo": 691,
      "started": 692,
      "come": 693,
      "gu": 694,
      "##ace": 695,
      "circling": 696,
      "upwards": 697,
      "mid": 698,
      "##dle": 699,
      "being": 700,
      "follows": 701,
      "looping": 702,
      "middle": 703,
      "##gion": 704,
      "region": 705,
      "throughout": 706,
      "traver": 707,
      "other": 708,
      "##as": 709,
      "off": 710,
      "ex": 711,
      "lat": 712,
      "sett": 713,
      "##veral": 714,
      "several": 715,
      "guide": 716,
      "later": 717,
      "flo": 718,
      "get": 719,
      "pat": 720,
      "##am": 721,
      "##tern": 722,
      "floor": 723,
      "com": 724,
      "areas": 725,
      "traverse": 726,
      "det": 727,
      "##pp": 728,
      "##ity": 729,
      "transitions": 730,
      "detour": 731,
      "all": 732,
      "cou": 733,
      "wall": 734,
      "##ond": 735,
      "one": 736,
      "ones": 737,
      "pattern": 738,
      "far": 739,
      "pl": 740,
      "sit": 741,
      "sec": 742,
      "##ina": 743,
      "second": 744,
      "land": 745,
      "vic": 746,
      "##inity": 747,
      "transitioning": 748,
      "counter": 749,
      "place": 750,
      "vicinity": 751,
      "fu": 752,
      "##ty": 753,
      "##king": 754,
      "final": 755,
      "gene": 756,
      "when": 757,
      "stayed": 758,
      "circles": 759,
      "##ively": 760,
      "13": 761,
      "11": 762,
      "55": 763,
      "app": 764,
      "not": 765,
      "reached": 766,
      "##ntion": 767,
      "mention": 768,
      "mentioned": 769,
      "ad": 770,
      "av": 771,
      "cur": 772,
      "su": 773,
      "##oid": 774,
      "##ia": 775,
      "##ous": 776,
      "##intain": 777,
      "afterwards": 778,
      "making": 779,
      "maintain": 780,
      "avoid": 781,
      "avoiding": 782,
      "14": 783,
      "17": 784,
      "23": 785,
      "30": 786,
      "33": 787,
      "31": 788,
      "41": 789,
      "##mp": 790,
      "inc": 791,
      "crosses": 792,
      "19": 793,
      "16": 794,
      "12": 795,
      "54": 796,
      "emp": 797,
      "##ole": 798,
      "##ious": 799,
      "##nder": 800,
      "##ates": 801,
      "station": 802,
      "specifically": 803,
      "empty": 804,
      "stationary": 805,
      "29": 806,
      "27": 807,
      "34": 808,
      "##din": 809,
      "##sp": 810,
      "##ordin": 811,
      "resp": 812,
      "##ectively": 813,
      "coordin": 814,
      "lastly": 815,
      "general": 816,
      "respectively": 817,
      "coordinates": 818,
      "22": 819,
      "37": 820,
      "fir": 821,
      "##plet": 822,
      "most": 823,
      "wander": 824,
      "exam": 825,
      "settling": 826,
      "complet": 827,
      "maintained": 828,
      "first": 829,
      "example": 830,
      "15": 831,
      "de": 832,
      "tw": 833,
      "##reas": 834,
      "init": 835,
      "##ance": 836,
      "##iko": 837,
      "settle": 838,
      "##reasing": 839,
      "initi": 840,
      ",!": 841,
      "18": 842,
      "26": 843,
      "52": 844,
      "dest": 845,
      "var": 846,
      "##ser": 847,
      "##ination": 848,
      "closer": 849,
      "##roach": 850,
      "begins": 851,
      "arrives": 852,
      "full": 853,
      "approach": 854,
      "increasing": 855,
      "mostly": 856,
      "dev": 857,
      "initial": 858,
      "destination": 859,
      "25": 860,
      "21": 861,
      "47": 862,
      "43": 863,
      "50": 864,
      "do": 865,
      "has": 866,
      "kitch": 867,
      "os": 868,
      "##que": 869,
      "find": 870,
      "during": 871,
      "downwards": 872,
      "##ika": 873,
      "two": 874,
      "devika": 875,
      "kitchen": 876,
      "osc": 877,
      "53": 878,
      "60": 879,
      "##ey": 880,
      "##eping": 881,
      "##ab": 882,
      "##bse": 883,
      "##stance": 884,
      "eastern": 885,
      "distance": 886,
      "keeping": 887,
      "movements": 888,
      "locations": 889,
      "subse": 890,
      "##quent": 891,
      "subsequent": 892,
      "74": 893,
      "est": 894,
      "jou": 895,
      "ol": 896,
      "pre": 897,
      "##dm": 898,
      "##eb": 899,
      "##able": 900,
      "##ied": 901,
      "##ga": 902,
      "##mation": 903,
      "##for": 904,
      "##ini": 905,
      "##ating": 906,
      "padm": 907,
      "infor": 908,
      "whole": 909,
      "till": 910,
      "##rney": 911,
      "##ified": 912,
      "specified": 913,
      "##rie": 914,
      "shifting": 915,
      "seconds": 916,
      "complete": 917,
      "subsequently": 918,
      "esteb": 919,
      "journey": 920,
      "olga": 921,
      "padmini": 922,
      "information": 923,
      "esteban": 924,
      "51": 925,
      "65": 926,
      "forth": 927,
      "hina": 928,
      "##low": 929,
      "##miko": 930,
      "onwards": 931,
      "below": 932,
      "shifts": 933,
      "fumiko": 934,
      "112": 935,
      "various": 936,
      "oscar": 937,
      "',": 938,
      "32": 939,
      "44": 940,
      "45": 941,
      "64": 942,
      "dina": 943,
      "gab": 944,
      "ib": 945,
      "jav": 946,
      "mu": 947,
      "part": 948,
      "ug": 949,
      "xia": 950,
      "##ad": 951,
      "##io": 952,
      "##ier": 953,
      "##lu": 954,
      "##li": 955,
      "##lik": 956,
      "##him": 957,
      "##van": 958,
      "##vious": 959,
      "##cep": 960,
      "##pable": 961,
      "capable": 962,
      "##rahim": 963,
      "once": 964,
      "##rent": 965,
      "paus": 966,
      "##ani": 967,
      "##ang": 968,
      "heads": 969,
      "ended": 970,
      "malik": 971,
      "sim": 972,
      "excep": 973,
      "coming": 974,
      "adam": 975,
      "curve": 976,
      "current": 977,
      "previous": 978,
      "##riel": 979,
      "dinah": 980,
      "gabriel": 981,
      "ibrahim": 982,
      "javier": 983,
      "ugo": 984,
      "except": 985,
      "42": 986,
      "57": 987,
      "68": 988,
      "gett": 989,
      "gio": 990,
      "ha": 991,
      "ind": 992,
      "uri": 993,
      "vi": 994,
      "wo": 995,
      "zig": 996,
      "##os": 997,
      "##ni": 998,
      "##ilar": 999,
      "##gang": 1000,
      "##lom": 1001,
      "thre": 1002,
      "them": 1003,
      "##ind": 1004,
      "##ori": 1005,
      "##ides": 1006,
      "reina": 1007,
      "solom": 1008,
      "northeastward": 1009,
      "forward": 1010,
      "times": 1011,
      "leo": 1012,
      "##lfgang": 1013,
      "337": 1014,
      "##olet": 1015,
      "##lud": 1016,
      "##vanni": 1017,
      "pause": 1018,
      "similar": 1019,
      "getting": 1020,
      "giovanni": 1021,
      "have": 1022,
      "indic": 1023,
      "violet": 1024,
      "wolfgang": 1025,
      "three": 1026,
      "solomon": 1027,
      "260": 1028,
      "69": 1029,
      "63": 1030,
      "61": 1031,
      "62": 1032,
      "70": 1033,
      "73": 1034,
      "71": 1035,
      "87": 1036,
      "],": 1037,
      "four": 1038,
      "here": 1039,
      "mar": 1040,
      "ming": 1041,
      "main": 1042,
      "mome": 1043,
      "opp": 1044,
      "vary": 1045,
      "xim": 1046,
      "##ah": 1047,
      "##tra": 1048,
      "##gori": 1049,
      "##sal": 1050,
      "##clo": 1051,
      "##zag": 1052,
      "thal": 1053,
      "##thm": 1054,
      "##ort": 1055,
      "##lla": 1056,
      "##lly": 1057,
      "##rally": 1058,
      "##erly": 1059,
      "##ena": 1060,
      "##ice": 1061,
      "bella": 1062,
      "##sse": 1063,
      "tia": 1064,
      "##ked": 1065,
      "afterward": 1066,
      "northwestward": 1067,
      "rosal": 1068,
      "space": 1069,
      "algori": 1070,
      "short": 1071,
      "##ations": 1072,
      "switching": 1073,
      "counterclo": 1074,
      "generally": 1075,
      "559": 1076,
      "235": 1077,
      "much": 1078,
      "zigzag": 1079,
      "##osite": 1080,
      "marked": 1081,
      "moment": 1082,
      "opposite": 1083,
      "ximena": 1084,
      "thalia": 1085,
      "rosalind": 1086,
      "algorithm": 1087,
      "counterclockwise": 1088,
      "36": 1089,
      "35": 1090,
      "48": 1091,
      "56": 1092,
      "72": 1093,
      "85": 1094,
      "ch": 1095,
      "im": 1096,
      "lar": 1097,
      "lea": 1098,
      "min": 1099,
      "na": 1100,
      "rad": 1101,
      "sam": 1102,
      "ve": 1103,
      "win": 1104,
      "##oint": 1105,
      "##nce": 1106,
      "##nown": 1107,
      "##ell": 1108,
      "##ius": 1109,
      "##iations": 1110,
      "##lat": 1111,
      "##known": 1112,
      "##point": 1113,
      "##ze": 1114,
      "thir": 1115,
      "##ston": 1116,
      "##les": 1117,
      "##arp": 1118,
      "##arles": 1119,
      "##ger": 1120,
      "relat": 1121,
      "##uel": 1122,
      "##omi": 1123,
      "southwestward": 1124,
      "was": 1125,
      "keiko": 1126,
      "proceeds": 1127,
      "alway": 1128,
      "sharp": 1129,
      "entirety": 1130,
      "size": 1131,
      "significantly": 1132,
      "prov": 1133,
      "unknown": 1134,
      "109": 1135,
      "101": 1136,
      "sure": 1137,
      "includ": 1138,
      "198": 1139,
      "161": 1140,
      "completing": 1141,
      "does": 1142,
      "mainly": 1143,
      "moments": 1144,
      "charles": 1145,
      "imani": 1146,
      "naomi": 1147,
      "radius": 1148,
      "samuel": 1149,
      "winston": 1150,
      "third": 1151,
      "relatively": 1152,
      "always": 1153,
      "'?": 1154,
      "59": 1155,
      "67": 1156,
      "75": 1157,
      "83": 1158,
      "could": 1159,
      "each": 1160,
      "lu": 1161,
      "man": 1162,
      "vis": 1163,
      "well": 1164,
      "zon": 1165,
      "##rice": 1166,
      "##nc": 1167,
      "##eat": 1168,
      "##cia": 1169,
      "##xim": 1170,
      "##jace": 1171,
      "toward": 1172,
      "##ound": 1173,
      "northern": 1174,
      "##atrice": 1175,
      "##lling": 1176,
      "refere": 1177,
      "yousse": 1178,
      "##eter": 1179,
      "trace": 1180,
      "beatrice": 1181,
      "backtra": 1182,
      "##iting": 1183,
      "northwestern": 1184,
      "keeps": 1185,
      "arc": 1186,
      "243": 1187,
      "travelling": 1188,
      "repeat": 1189,
      "edges": 1190,
      "104": 1191,
      "102": 1192,
      "guides": 1193,
      "travers": 1194,
      "appli": 1195,
      "adjace": 1196,
      "306": 1197,
      "317": 1198,
      "544": 1199,
      "settles": 1200,
      "variations": 1201,
      "indicated": 1202,
      "leaving": 1203,
      "minor": 1204,
      "veer": 1205,
      "lucia": 1206,
      "manner": 1207,
      "zone": 1208,
      "youssef": 1209,
      "backtrack": 1210,
      "adjacent": 1211,
      "46": 1212,
      "58": 1213,
      "66": 1214,
      "79": 1215,
      "76": 1216,
      "77": 1217,
      "84": 1218,
      "86": 1219,
      "94": 1220,
      "97": 1221,
      "91": 1222,
      "]?": 1223,
      "ab": 1224,
      "cove": 1225,
      "eli": 1226,
      "ground": 1227,
      "hove": 1228,
      "ju": 1229,
      "kha": 1230,
      "lit": 1231,
      "per": 1232,
      "qad": 1233,
      "sur": 1234,
      "sides": 1235,
      "vani": 1236,
      "zar": 1237,
      "##um": 1238,
      "##ost": 1239,
      "##dition": 1240,
      "##ear": 1241,
      "##end": 1242,
      "##ily": 1243,
      "##tle": 1244,
      "##ting": 1245,
      "##lt": 1246,
      "##lid": 1247,
      "##vance": 1248,
      "##ces": 1249,
      "##most": 1250,
      "##per": 1251,
      "##jah": 1252,
      "they": 1253,
      "stead": 1254,
      "##ided": 1255,
      "need": 1256,
      "##red": 1257,
      "##gher": 1258,
      "##eath": 1259,
      "higher": 1260,
      "northeastern": 1261,
      "##ited": 1262,
      "southeastward": 1263,
      "##illating": 1264,
      "upper": 1265,
      "began": 1266,
      "key": 1267,
      "spend": 1268,
      "noor": 1269,
      "altern": 1270,
      "finishing": 1271,
      "stepping": 1272,
      "205": 1273,
      "390": 1274,
      "392": 1275,
      "286": 1276,
      "285": 1277,
      "282": 1278,
      "246": 1279,
      "changed": 1280,
      "travels": 1281,
      "waypoint": 1282,
      "##imeter": 1283,
      "yourself": 1284,
      "100": 1285,
      "105": 1286,
      "108": 1287,
      "103": 1288,
      "387": 1289,
      "388": 1290,
      "382": 1291,
      "exp": 1292,
      "exiting": 1293,
      "patch": 1294,
      "farah": 1295,
      "113": 1296,
      "558": 1297,
      "appear": 1298,
      "addition": 1299,
      "advance": 1300,
      "maintaining": 1301,
      "141": 1302,
      "142": 1303,
      "308": 1304,
      "318": 1305,
      "412": 1306,
      "196": 1307,
      "129": 1308,
      "123": 1309,
      "297": 1310,
      "295": 1311,
      "276": 1312,
      "155": 1313,
      "186": 1314,
      "255": 1315,
      "oscillating": 1316,
      "539": 1317,
      "443": 1318,
      "indicating": 1319,
      "larger": 1320,
      "provided": 1321,
      "includes": 1322,
      "visited": 1323,
      "reference": 1324,
      "traversing": 1325,
      "above": 1326,
      "covered": 1327,
      "elijah": 1328,
      "hover": 1329,
      "khalid": 1330,
      "little": 1331,
      "perimeter": 1332,
      "qadir": 1333,
      "zara": 1334,
      "steadily": 1335,
      "waypoints": 1336,
      "additional": 1337
    }
  }
}