{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "/": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      ":": 24,
      ";": 25,
      "=": 26,
      "?": 27,
      "[": 28,
      "]": 29,
      "_": 30,
      "a": 31,
      "b": 32,
      "c": 33,
      "d": 34,
      "e": 35,
      "f": 36,
      "g": 37,
      "h": 38,
      "i": 39,
      "j": 40,
      "k": 41,
      "l": 42,
      "m": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "q": 47,
      "r": 48,
      "s": 49,
      "t": 50,
      "u": 51,
      "v": 52,
      "w": 53,
      "x": 54,
      "y": 55,
      "z": 56,
      "{": 57,
      "}": 58,
      "’": 59,
      "##8": 60,
      "##2": 61,
      "##_": 62,
      "##1": 63,
      "##.": 64,
      "##0": 65,
      "##5": 66,
      "##9": 67,
      "##h": 68,
      "##i": 69,
      "##c": 70,
      "##e": 71,
      "##o": 72,
      "##a": 73,
      "##k": 74,
      "##t": 75,
      "##r": 76,
      "##s": 77,
      "##b": 78,
      "##l": 79,
      "##4": 80,
      "##7": 81,
      "##v": 82,
      "##d": 83,
      "##w": 84,
      "##n": 85,
      "##u": 86,
      "##q": 87,
      "##g": 88,
      "##y": 89,
      "##j": 90,
      "##3": 91,
      "##m": 92,
      "##p": 93,
      "##6": 94,
      "##f": 95,
      "##x": 96,
      "##,": 97,
      "##?": 98,
      "##z": 99,
      "##!": 100,
      "th": 101,
      "the": 102,
      "to": 103,
      "of": 104,
      "##st": 105,
      "##th": 106,
      "##in": 107,
      "##ov": 108,
      "##ove": 109,
      "##ou": 110,
      "then": 111,
      "##or": 112,
      "st": 113,
      "##ge": 114,
      "##ea": 115,
      "##le": 116,
      "fr": 117,
      "an": 118,
      "##id": 119,
      "and": 120,
      "frid": 121,
      "fridge": 122,
      "##ast": 123,
      "##ile": 124,
      "east": 125,
      "##orth": 126,
      "north": 127,
      "##est": 128,
      "tile": 129,
      "##at": 130,
      "ca": 131,
      "move": 132,
      "sou": 133,
      "south": 134,
      "west": 135,
      "##ll": 136,
      "##ear": 137,
      "near": 138,
      "stove": 139,
      "##nt": 140,
      "po": 141,
      "##ing": 142,
      "can": 143,
      "that": 144,
      "##ed": 145,
      "##ir": 146,
      "##ic": 147,
      "you": 148,
      "##ar": 149,
      "go": 150,
      "##ra": 151,
      "##ha": 152,
      "cha": 153,
      "##et": 154,
      "chair": 155,
      "##lic": 156,
      "polic": 157,
      "policy": 158,
      "##ue": 159,
      "##er": 160,
      "##bin": 161,
      "##binet": 162,
      "##all": 163,
      "cabinet": 164,
      "##ally": 165,
      "fin": 166,
      "##ow": 167,
      "##rea": 168,
      "finally": 169,
      "##llow": 170,
      "on": 171,
      "tiles": 172,
      "##en": 173,
      "age": 174,
      "agent": 175,
      "##ink": 176,
      "pink": 177,
      "##ct": 178,
      "##op": 179,
      "stop": 180,
      "ba": 181,
      "##ble": 182,
      "##ate": 183,
      "co": 184,
      "##te": 185,
      "##art": 186,
      "start": 187,
      "##ect": 188,
      "##es": 189,
      "##om": 190,
      "##ld": 191,
      "##ould": 192,
      "##war": 193,
      "##ward": 194,
      "sh": 195,
      "ye": 196,
      "yellow": 197,
      "should": 198,
      "##ject": 199,
      "stat": 200,
      "statue": 201,
      "##tu": 202,
      "it": 203,
      "tra": 204,
      "crea": 205,
      "create": 206,
      "##thtu": 207,
      "bathtu": 208,
      "bathtub": 209,
      "##wards": 210,
      "##ory": 211,
      "##jectory": 212,
      "trajectory": 213,
      "##east": 214,
      "be": 215,
      "from": 216,
      "towards": 217,
      "gen": 218,
      "gener": 219,
      "generate": 220,
      "area": 221,
      "##able": 222,
      "##west": 223,
      "##re": 224,
      "red": 225,
      "table": 226,
      "##on": 227,
      "gra": 228,
      "##for": 229,
      "gray": 230,
      "befor": 231,
      "before": 232,
      "##ion": 233,
      "is": 234,
      "##ur": 235,
      "##ch": 236,
      "cont": 237,
      "contin": 238,
      "##an": 239,
      "rea": 240,
      "reach": 241,
      "continue": 242,
      "fo": 243,
      "follow": 244,
      "fan": 245,
      "moves": 246,
      "##int": 247,
      "##gh": 248,
      "point": 249,
      "##it": 250,
      "gre": 251,
      "bed": 252,
      "green": 253,
      "##ft": 254,
      "in": 255,
      "going": 256,
      "##rou": 257,
      "so": 258,
      "gu": 259,
      "guid": 260,
      "##fa": 261,
      "sofa": 262,
      "##ition": 263,
      "##ss": 264,
      "##sition": 265,
      "##ping": 266,
      "stopping": 267,
      "position": 268,
      "wh": 269,
      "aft": 270,
      "after": 271,
      "northeast": 272,
      "by": 273,
      "pa": 274,
      "##lor": 275,
      "color": 276,
      "pass": 277,
      "guides": 278,
      "##nge": 279,
      "at": 280,
      "throu": 281,
      "through": 282,
      "ora": 283,
      "orange": 284,
      "##il": 285,
      "na": 286,
      "##ig": 287,
      "unt": 288,
      "until": 289,
      "northwest": 290,
      "passing": 291,
      "mov": 292,
      "moving": 293,
      "##ck": 294,
      "able": 295,
      "colored": 296,
      "southwest": 297,
      "back": 298,
      "southeast": 299,
      "##vig": 300,
      "navig": 301,
      "##ead": 302,
      "##nd": 303,
      "head": 304,
      "navigate": 305,
      "file": 306,
      "##oc": 307,
      "##urn": 308,
      "##ke": 309,
      "goes": 310,
      "starts": 311,
      "##ake": 312,
      "ne": 313,
      "##ain": 314,
      "make": 315,
      "##lue": 316,
      "##ep": 317,
      "##xt": 318,
      "next": 319,
      "blue": 320,
      "end": 321,
      "##nto": 322,
      "ag": 323,
      "again": 324,
      "##im": 325,
      "##ith": 326,
      "##us": 327,
      "cact": 328,
      "cactus": 329,
      "##ple": 330,
      "pur": 331,
      "purple": 332,
      "tim": 333,
      "##ay": 334,
      "turn": 335,
      "hi": 336,
      "stay": 337,
      "##ite": 338,
      "white": 339,
      "pr": 340,
      "onto": 341,
      "with": 342,
      "wa": 343,
      "proc": 344,
      "##eed": 345,
      "proceed": 346,
      "##estep": 347,
      "timestep": 348,
      "reaching": 349,
      "##se": 350,
      "##ill": 351,
      "##ther": 352,
      "loc": 353,
      "locat": 354,
      "stops": 355,
      "there": 356,
      "want": 357,
      "##igh": 358,
      "##ight": 359,
      "followed": 360,
      "##me": 361,
      "##ich": 362,
      "which": 363,
      "tiled": 364,
      "top": 365,
      "cir": 366,
      "circ": 367,
      "following": 368,
      "circle": 369,
      "##iv": 370,
      "still": 371,
      "for": 372,
      "al": 373,
      "located": 374,
      "##ner": 375,
      "reaches": 376,
      "while": 377,
      "ret": 378,
      "return": 379,
      "cor": 380,
      "right": 381,
      "corner": 382,
      "up": 383,
      "ro": 384,
      "room": 385,
      "##other": 386,
      "another": 387,
      "##round": 388,
      "around": 389,
      "giv": 390,
      "given": 391,
      "##ent": 392,
      "starting": 393,
      "ob": 394,
      "object": 395,
      "##if": 396,
      "dir": 397,
      "direct": 398,
      "pl": 399,
      "##ease": 400,
      "please": 401,
      "sa": 402,
      "ends": 403,
      "same": 404,
      "##is": 405,
      "##ly": 406,
      "##em": 407,
      "continues": 408,
      "guide": 409,
      "direction": 410,
      "cl": 411,
      "des": 412,
      "no": 413,
      "allow": 414,
      "sp": 415,
      "fur": 416,
      "further": 417,
      "allows": 418,
      "heading": 419,
      "##ec": 420,
      "##gor": 421,
      "##ithm": 422,
      "algor": 423,
      "algorithm": 424,
      "clo": 425,
      "##etw": 426,
      "som": 427,
      "some": 428,
      "10": 429,
      "into": 430,
      "spec": 431,
      "specif": 432,
      "time": 433,
      "beg": 434,
      "begin": 435,
      "bo": 436,
      "ke": 437,
      "this": 438,
      "##nter": 439,
      "eastward": 440,
      "any": 441,
      "##ro": 442,
      "keep": 443,
      "enter": 444,
      "close": 445,
      "##ross": 446,
      "location": 447,
      "##out": 448,
      "rem": 449,
      "remain": 450,
      "objects": 451,
      "my": 452,
      "name": 453,
      "##lk": 454,
      "walk": 455,
      "without": 456,
      "le": 457,
      "specific": 458,
      "netw": 459,
      "##ork": 460,
      "network": 461,
      "step": 462,
      "left": 463,
      "will": 464,
      "sl": 465,
      "staying": 466,
      "##by": 467,
      "nearby": 468,
      "##ant": 469,
      "ending": 470,
      "as": 471,
      "follows": 472,
      "##ere": 473,
      "its": 474,
      "timesteps": 475,
      "desc": 476,
      "where": 477,
      "continu": 478,
      "##ign": 479,
      "continuing": 480,
      "##al": 481,
      "##qu": 482,
      "cross": 483,
      "en": 484,
      "##60": 485,
      "squ": 486,
      "##20": 487,
      "squar": 488,
      "square": 489,
      "slight": 490,
      "##so": 491,
      "##pable": 492,
      "capable": 493,
      "also": 494,
      "11": 495,
      "would": 496,
      "sem": 497,
      "slightly": 498,
      "##antic": 499,
      "semantic": 500,
      "##ve": 501,
      "both": 502,
      "eastwards": 503,
      "##rr": 504,
      "arr": 505,
      "design": 506,
      "arriv": 507,
      "##fer": 508,
      "##ri": 509,
      "li": 510,
      "or": 511,
      "like": 512,
      "##ually": 513,
      "remains": 514,
      "semantics": 515,
      "dif": 516,
      "##ferent": 517,
      "different": 518,
      "stays": 519,
      "##ide": 520,
      "##ish": 521,
      "descri": 522,
      "##res": 523,
      ").": 524,
      "finish": 525,
      "##ong": 526,
      "ev": 527,
      "proceeding": 528,
      "along": 529,
      "are": 530,
      "now": 531,
      "colors": 532,
      "event": 533,
      "eventually": 534,
      "side": 535,
      "),": 536,
      "20": 537,
      "navigates": 538,
      "39": 539,
      "##tion": 540,
      "##vel": 541,
      "fir": 542,
      "first": 543,
      "40": 544,
      "last": 545,
      "arrive": 546,
      "rep": 547,
      "##ation": 548,
      "28": 549,
      "##tt": 550,
      "##end": 551,
      "bott": 552,
      "steps": 553,
      "bottom": 554,
      "cur": 555,
      "24": 556,
      "describ": 557,
      "ac": 558,
      "##ce": 559,
      "##itch": 560,
      "399": 561,
      "##and": 562,
      "enable": 563,
      "200": 564,
      "described": 565,
      "sw": 566,
      "switch": 567,
      "being": 568,
      "##rent": 569,
      "current": 570,
      "change": 571,
      "##lf": 572,
      "##ment": 573,
      "280": 574,
      "##ure": 575,
      "past": 576,
      "southward": 577,
      "movement": 578,
      "positions": 579,
      "##self": 580,
      "320": 581,
      "240": 582,
      "160": 583,
      "enables": 584,
      "80": 585,
      "360": 586,
      "##ented": 587,
      "##resented": 588,
      "represented": 589,
      "itself": 590,
      "##ated": 591,
      "120": 592,
      "within": 593,
      "take": 594,
      "betw": 595,
      "##een": 596,
      "between": 597,
      "va": 598,
      "##lues": 599,
      "values": 600,
      "re": 601,
      "way": 602,
      "##ord": 603,
      "ment": 604,
      "si": 605,
      "mention": 606,
      "travel": 607,
      "inst": 608,
      "returning": 609,
      "lo": 610,
      "##ru": 611,
      "##sure": 612,
      "crossing": 613,
      "ensure": 614,
      "##ruct": 615,
      "instruct": 616,
      "loop": 617,
      "##ary": 618,
      "##tuated": 619,
      "points": 620,
      "situated": 621,
      "##ver": 622,
      "##inate": 623,
      "coord": 624,
      "coordinate": 625,
      "northward": 626,
      "westward": 627,
      "final": 628,
      "note": 629,
      "##own": 630,
      "##form": 631,
      "fe": 632,
      "stand": 633,
      "across": 634,
      "ed": 635,
      "##ut": 636,
      "##ous": 637,
      "coordinates": 638,
      "few": 639,
      "edge": 640,
      "##um": 641,
      "positioned": 642,
      "descend": 643,
      "passes": 644,
      "inform": 645,
      "information": 646,
      "down": 647,
      "##ise": 648,
      "afterwards": 649,
      "but": 650,
      "de": 651,
      "mor": 652,
      "##wise": 653,
      "##nsition": 654,
      "transition": 655,
      "##ckwise": 656,
      "more": 657,
      "su": 658,
      "turns": 659,
      "##vi": 660,
      "once": 661,
      "##ating": 662,
      "cent": 663,
      "##way": 664,
      "##ern": 665,
      "new": 666,
      "clockwise": 667,
      "dic": 668,
      "##tionary": 669,
      "center": 670,
      "dictionary": 671,
      "num": 672,
      "##ical": 673,
      "##erical": 674,
      "specifically": 675,
      "numerical": 676,
      "rest": 677,
      "##_c": 678,
      "##abinet": 679,
      "file_c": 680,
      "pro": 681,
      "file_cabinet": 682,
      "away": 683,
      "##ia": 684,
      "##ied": 685,
      "##que": 686,
      "need": 687,
      "specified": 688,
      "##ses": 689,
      "##gres": 690,
      "progres": 691,
      "ex": 692,
      "navigating": 693,
      "##imb": 694,
      "climb": 695,
      "##velop": 696,
      "develop": 697,
      "',": 698,
      "progresses": 699,
      "southwards": 700,
      "lastly": 701,
      "mentioned": 702,
      "path": 703,
      "##cend": 704,
      "##ot": 705,
      "areas": 706,
      "spot": 707,
      "ascend": 708,
      "man": 709,
      "not": 710,
      "manner": 711,
      "these": 712,
      "mo": 713,
      "##owly": 714,
      "slowly": 715,
      "changes": 716,
      "pre": 717,
      "##vo": 718,
      "##vious": 719,
      "previous": 720,
      "avo": 721,
      "your": 722,
      "turning": 723,
      "avoid": 724,
      "traver": 725,
      "afterward": 726,
      "acc": 727,
      "enters": 728,
      "sign": 729,
      "##sing": 730,
      "##icant": 731,
      "##ificant": 732,
      "significant": 733,
      "##bse": 734,
      "subse": 735,
      "##quent": 736,
      "subsequent": 737,
      "12": 738,
      "##ging": 739,
      "##iti": 740,
      "initi": 741,
      "locations": 742,
      "##ach": 743,
      "##nging": 744,
      "changing": 745,
      "prov": 746,
      "returns": 747,
      "remaining": 748,
      "se": 749,
      "stra": 750,
      "straight": 751,
      "##ption": 752,
      "##our": 753,
      "description": 754,
      "motion": 755,
      "##ive": 756,
      "dest": 757,
      "dia": 758,
      "##gon": 759,
      "##ination": 760,
      "moved": 761,
      "##ond": 762,
      "arriving": 763,
      "traverse": 764,
      "destination": 765,
      "diagon": 766,
      "##der": 767,
      "##ral": 768,
      "exa": 769,
      "subsequently": 770,
      "diagonally": 771,
      "sec": 772,
      "un": 773,
      "northwards": 774,
      "stoping": 775,
      "##igin": 776,
      "origin": 777,
      "second": 778,
      "using": 779,
      "##ine": 780,
      "walking": 781,
      "38": 782,
      "other": 783,
      "##ided": 784,
      "upwards": 785,
      "provided": 786,
      "ma": 787,
      "##eat": 788,
      "entering": 789,
      "each": 790,
      "line": 791,
      "over": 792,
      "tw": 793,
      "##cl": 794,
      "initial": 795,
      "mid": 796,
      "##dle": 797,
      "when": 798,
      "middle": 799,
      "ha": 800,
      "land": 801,
      "##ift": 802,
      "##mple": 803,
      "one": 804,
      "##ately": 805,
      "shift": 806,
      "order": 807,
      "repeat": 808,
      "avoiding": 809,
      "sure": 810,
      "##ul": 811,
      "grey": 812,
      "directions": 813,
      "get": 814,
      "##ud": 815,
      "##urately": 816,
      "accurately": 817,
      "##clud": 818,
      "14": 819,
      "13": 820,
      "ad": 821,
      "lat": 822,
      "lead": 823,
      "##ling": 824,
      "ones": 825,
      "closely": 826,
      "unit": 827,
      "later": 828,
      "##mp": 829,
      "original": 830,
      "units": 831,
      "49": 832,
      "ab": 833,
      "det": 834,
      "emp": 835,
      "sit": 836,
      "sim": 837,
      "##ty": 838,
      "off": 839,
      "westwards": 840,
      "transitions": 841,
      "transitioning": 842,
      "empty": 843,
      "me": 844,
      "##ning": 845,
      "beginning": 846,
      "##dually": 847,
      "##ina": 848,
      "gradually": 849,
      "##veral": 850,
      "several": 851,
      "above": 852,
      "55": 853,
      "##low": 854,
      "##gion": 855,
      "below": 856,
      "includ": 857,
      "region": 858,
      "##ively": 859,
      "60": 860,
      "bit": 861,
      "##ik": 862,
      "exact": 863,
      "detour": 864,
      "17": 865,
      "16": 866,
      "a_": 867,
      "all": 868,
      "wall": 869,
      "##atch": 870,
      "##ari": 871,
      "con": 872,
      "come": 873,
      "gene": 874,
      "##ions": 875,
      "circling": 876,
      "rel": 877,
      "mentioning": 878,
      "looping": 879,
      "two": 880,
      "vari": 881,
      "##oor": 882,
      "relat": 883,
      "23": 884,
      "30": 885,
      "33": 886,
      "41": 887,
      "far": 888,
      "res": 889,
      "##tern": 890,
      "##nce": 891,
      "##pp": 892,
      "##pect": 893,
      "##intain": 894,
      "such": 895,
      "maintain": 896,
      "respect": 897,
      "19": 898,
      "31": 899,
      "54": 900,
      "fl": 901,
      "match": 902,
      "sm": 903,
      "##ace": 904,
      "##ounter": 905,
      "##ark": 906,
      "northwestern": 907,
      "crosses": 908,
      "##quence": 909,
      "sequence": 910,
      "##ult": 911,
      "respectively": 912,
      "floor": 913,
      "small": 914,
      "15": 915,
      "27": 916,
      "do": 917,
      "dur": 918,
      "mark": 919,
      "pat": 920,
      "##ice": 921,
      "started": 922,
      "reached": 923,
      "##ity": 924,
      "throughout": 925,
      "refer": 926,
      "descriptions": 927,
      "example": 928,
      "relative": 929,
      "marked": 930,
      "pattern": 931,
      "18": 932,
      "22": 933,
      "37": 934,
      "ta": 935,
      "them": 936,
      "instructions": 937,
      "has": 938,
      "29": 939,
      "34": 940,
      "52": 941,
      "set": 942,
      "##dic": 943,
      "##ust": 944,
      "##und": 945,
      "thir": 946,
      "redund": 947,
      "indic": 948,
      "have": 949,
      "general": 950,
      "maintained": 951,
      "tak": 952,
      "sett": 953,
      "third": 954,
      "25": 955,
      "62": 956,
      "61": 957,
      "app": 958,
      "cove": 959,
      "part": 960,
      "use": 961,
      "vic": 962,
      "##ies": 963,
      "##rs": 964,
      "##dition": 965,
      "##inity": 966,
      "comple": 967,
      "addition": 968,
      "##iko": 969,
      "vicinity": 970,
      ",!": 971,
      "43": 972,
      "65": 973,
      "64": 974,
      "counter": 975,
      "ent": 976,
      "##eous": 977,
      "##ount": 978,
      "##lly": 979,
      "##aneous": 980,
      "guiding": 981,
      "##ilar": 982,
      "##quest": 983,
      "arrives": 984,
      "request": 985,
      "account": 986,
      "twice": 987,
      "simult": 988,
      "similar": 989,
      "various": 990,
      "covers": 991,
      "complete": 992,
      "##aneously": 993,
      "simultaneously": 994,
      "21": 995,
      "26": 996,
      "47": 997,
      "57": 998,
      "53": 999,
      "just": 1000,
      "##ab": 1001,
      "##ka": 1002,
      "##les": 1003,
      "##ire": 1004,
      "##ering": 1005,
      "##erly": 1006,
      "find": 1007,
      "com": 1008,
      "##anc": 1009,
      "proceeds": 1010,
      "circul": 1011,
      "forward": 1012,
      "112": 1013,
      "devi": 1014,
      "exp": 1015,
      "mak": 1016,
      "does": 1017,
      "redundanc": 1018,
      "indicated": 1019,
      "entire": 1020,
      "circular": 1021,
      "devika": 1022,
      "59": 1023,
      "56": 1024,
      "##ac": 1025,
      "##ess": 1026,
      "navigation": 1027,
      "begins": 1028,
      "downwards": 1029,
      "initially": 1030,
      "include": 1031,
      "cons": 1032,
      "redundancies": 1033,
      "32": 1034,
      "awar": 1035,
      "est": 1036,
      "ja": 1037,
      "ol": 1038,
      "wand": 1039,
      "##eb": 1040,
      "##el": 1041,
      "##ey": 1042,
      "##sed": 1043,
      "##dm": 1044,
      "##ga": 1045,
      "##ini": 1046,
      "station": 1047,
      "northeastern": 1048,
      "padm": 1049,
      "##roach": 1050,
      "most": 1051,
      "includes": 1052,
      "referen": 1053,
      "takes": 1054,
      "approach": 1055,
      "additionally": 1056,
      "consid": 1057,
      "aware": 1058,
      "esteb": 1059,
      "olga": 1060,
      "stationary": 1061,
      "padmini": 1062,
      "esteban": 1063,
      "42": 1064,
      "44": 1065,
      "51": 1066,
      "68": 1067,
      "66": 1068,
      "85": 1069,
      "],": 1070,
      "act": 1071,
      "fum": 1072,
      "four": 1073,
      "hina": 1074,
      "jour": 1075,
      "os": 1076,
      "vis": 1077,
      "##car": 1078,
      "##ney": 1079,
      "##x20": 1080,
      "thre": 1081,
      "##lev": 1082,
      "##licit": 1083,
      "onwards": 1084,
      "space": 1085,
      "200x20": 1086,
      "shifts": 1087,
      "during": 1088,
      "explicit": 1089,
      "making": 1090,
      "wander": 1091,
      "mostly": 1092,
      "considering": 1093,
      "fumiko": 1094,
      "journey": 1095,
      "oscar": 1096,
      "visit": 1097,
      "three": 1098,
      "200x200": 1099,
      "explicitly": 1100,
      "'.": 1101,
      "50": 1102,
      "63": 1103,
      "73": 1104,
      "dina": 1105,
      "gab": 1106,
      "ib": 1107,
      "mal": 1108,
      "per": 1109,
      "sur": 1110,
      "ug": 1111,
      "xia": 1112,
      "##him": 1113,
      "##ip": 1114,
      "##ole": 1115,
      "##am": 1116,
      "eastern": 1117,
      "northern": 1118,
      "##rahim": 1119,
      "##ani": 1120,
      "directly": 1121,
      "place": 1122,
      "remainder": 1123,
      "##riel": 1124,
      "##vier": 1125,
      "provide": 1126,
      "adam": 1127,
      "duration": 1128,
      "javier": 1129,
      "##levant": 1130,
      "dinah": 1131,
      "gabriel": 1132,
      "ibrahim": 1133,
      "malik": 1134,
      "ugo": 1135,
      "70": 1136,
      "74": 1137,
      "gi": 1138,
      "sk": 1139,
      "till": 1140,
      "uri": 1141,
      "vi": 1142,
      "wo": 1143,
      "zon": 1144,
      "##cc": 1145,
      "##cep": 1146,
      "##lom": 1147,
      "##vir": 1148,
      "##ni": 1149,
      "##nown": 1150,
      "##ully": 1151,
      "##gan": 1152,
      "##fully": 1153,
      "##ind": 1154,
      "##ovan": 1155,
      "##ntion": 1156,
      "##tention": 1157,
      "##onment": 1158,
      "solom": 1159,
      "pay": 1160,
      "attention": 1161,
      "heads": 1162,
      "circles": 1163,
      "leo": 1164,
      "envir": 1165,
      "##lfgan": 1166,
      "reina": 1167,
      "relevant": 1168,
      "succ": 1169,
      "excep": 1170,
      "avoids": 1171,
      "a_1": 1172,
      "337": 1173,
      "settling": 1174,
      "##essfully": 1175,
      "##olet": 1176,
      "giovan": 1177,
      "violet": 1178,
      "wolfgan": 1179,
      "zone": 1180,
      "solomon": 1181,
      "environment": 1182,
      "successfully": 1183,
      "except": 1184,
      "giovanni": 1185,
      "wolfgang": 1186,
      "260": 1187,
      "35": 1188,
      "48": 1189,
      "45": 1190,
      "67": 1191,
      "71": 1192,
      "75": 1193,
      "97": 1194,
      "ming": 1195,
      "tia": 1196,
      "vary": 1197,
      "xim": 1198,
      "##ef": 1199,
      "##ell": 1200,
      "##oint": 1201,
      "##ah": 1202,
      "##ting": 1203,
      "##sal": 1204,
      "##yth": 1205,
      "##point": 1206,
      "thal": 1207,
      "##lla": 1208,
      "##lling": 1209,
      "##rally": 1210,
      "##ena": 1211,
      "based": 1212,
      "trave": 1213,
      "bella": 1214,
      "times": 1215,
      "stayed": 1216,
      "rosal": 1217,
      "101": 1218,
      "109": 1219,
      "curve": 1220,
      "currently": 1221,
      "yourself": 1222,
      "traversing": 1223,
      "seconds": 1224,
      "shifting": 1225,
      "559": 1226,
      "conclud": 1227,
      "generally": 1228,
      "235": 1229,
      "skip": 1230,
      "ximena": 1231,
      "thalia": 1232,
      "travelling": 1233,
      "rosalind": 1234,
      "69": 1235,
      "72": 1236,
      "87": 1237,
      "83": 1238,
      "98": 1239,
      "ch": 1240,
      "fu": 1241,
      "forth": 1242,
      "im": 1243,
      "mult": 1244,
      "opp": 1245,
      "pyth": 1246,
      "rand": 1247,
      "win": 1248,
      "well": 1249,
      "yet": 1250,
      "zig": 1251,
      "##iple": 1252,
      "##counter": 1253,
      "##eping": 1254,
      "##os": 1255,
      "##ockwise": 1256,
      "##ad": 1257,
      "##ag": 1258,
      "##known": 1259,
      "##ying": 1260,
      "##mue": 1261,
      "##ston": 1262,
      "##arles": 1263,
      "##omi": 1264,
      "##ance": 1265,
      "inc": 1266,
      "paus": 1267,
      "naomi": 1268,
      "northwestward": 1269,
      "ended": 1270,
      "samue": 1271,
      "102": 1272,
      "100": 1273,
      "keiko": 1274,
      "keeping": 1275,
      "keeps": 1276,
      "encounter": 1277,
      "finishing": 1278,
      "##ations": 1279,
      "movements": 1280,
      "##ording": 1281,
      "standing": 1282,
      "according": 1283,
      "unknown": 1284,
      "##clockwise": 1285,
      "161": 1286,
      "198": 1287,
      "settle": 1288,
      "counterclockwise": 1289,
      "coming": 1290,
      "referenc": 1291,
      "reference": 1292,
      "fourth": 1293,
      "perform": 1294,
      "surround": 1295,
      "skipping": 1296,
      "charles": 1297,
      "full": 1298,
      "imani": 1299,
      "multiple": 1300,
      "oppos": 1301,
      "python": 1302,
      "random": 1303,
      "winston": 1304,
      "pause": 1305,
      "samuel": 1306,
      "opposite": 1307,
      "'?": 1308,
      "36": 1309,
      "46": 1310,
      "58": 1311,
      "76": 1312,
      "88": 1313,
      "86": 1314,
      "91": 1315,
      "93": 1316,
      "].": 1317,
      "beat": 1318,
      "could": 1319,
      "here": 1320,
      "lu": 1321,
      "main": 1322,
      "##ist": 1323,
      "##cia": 1324,
      "##ring": 1325,
      "##rice": 1326,
      "##ser": 1327,
      "##per": 1328,
      "##zag": 1329,
      "toward": 1330,
      "##stac": 1331,
      "youss": 1332,
      "##arp": 1333,
      "##arge": 1334,
      "##reasing": 1335,
      "sharp": 1336,
      "northeastward": 1337,
      "southwestward": 1338,
      "was": 1339,
      "alway": 1340,
      "upper": 1341,
      "obstac": 1342,
      "closer": 1343,
      "specifying": 1344,
      "stepping": 1345,
      "243": 1346,
      "switching": 1347,
      "waypoint": 1348,
      "travels": 1349,
      "edges": 1350,
      "needs": 1351,
      "exit": 1352,
      "145": 1353,
      "variations": 1354,
      "306": 1355,
      "317": 1356,
      "544": 1357,
      "additional": 1358,
      "combin": 1359,
      "actions": 1360,
      "conclude": 1361,
      "zigzag": 1362,
      "increasing": 1363,
      "beatrice": 1364,
      "lucia": 1365,
      "mainly": 1366,
      "youssef": 1367,
      "always": 1368,
      "obstacles": 1369,
      "waypoints": 1370,
      ")?": 1371,
      "78": 1372,
      "79": 1373,
      "77": 1374,
      "96": 1375,
      "]?": 1376,
      "ah": 1377,
      "am": 1378,
      "bu": 1379,
      "dist": 1380,
      "el": 1381,
      "id": 1382,
      "kha": 1383,
      "kitch": 1384,
      "large": 1385,
      "must": 1386,
      "patch": 1387,
      "qad": 1388,
      "ter": 1389,
      "used": 1390,
      "vani": 1391,
      "zar": 1392,
      "##ij": 1393,
      "##ild": 1394,
      "##ail": 1395,
      "##lid": 1396,
      "##vance": 1397,
      "##nec": 1398,
      "##jac": 1399,
      "##ms": 1400,
      "##xim": 1401,
      "than": 1402,
      "they": 1403,
      "their": 1404,
      "##ound": 1405,
      "##led": 1406,
      "easterly": 1407,
      "western": 1408,
      "##ract": 1409,
      "##eter": 1410,
      "trace": 1411,
      "generating": 1412,
      "contain": 1413,
      "##face": 1414,
      "northwesterly": 1415,
      "southeastward": 1416,
      "##imeter": 1417,
      "##entif": 1418,
      "noor": 1419,
      "108": 1420,
      "105": 1421,
      "104": 1422,
      "103": 1423,
      "key": 1424,
      "111": 1425,
      "117": 1426,
      "205": 1427,
      "392": 1428,
      "390": 1429,
      "282": 1430,
      "285": 1431,
      "286": 1432,
      "246": 1433,
      "stands": 1434,
      "progress": 1435,
      "traverses": 1436,
      "129": 1437,
      "123": 1438,
      "unnec": 1439,
      "388": 1440,
      "382": 1441,
      "387": 1442,
      "repeating": 1443,
      "142": 1444,
      "141": 1445,
      "136": 1446,
      "advance": 1447,
      "adjac": 1448,
      "detail": 1449,
      "558": 1450,
      "163": 1451,
      "a_t": 1452,
      "variable": 1453,
      "relatively": 1454,
      "308": 1455,
      "412": 1456,
      "farah": 1457,
      "maintaining": 1458,
      "196": 1459,
      "318": 1460,
      "155": 1461,
      "276": 1462,
      "referring": 1463,
      "180": 1464,
      "186": 1465,
      "295": 1466,
      "297": 1467,
      "redundant": 1468,
      "indicating": 1469,
      "taken": 1470,
      "settles": 1471,
      "255": 1472,
      "539": 1473,
      "explor": 1474,
      "makes": 1475,
      "##acing": 1476,
      "##essary": 1477,
      "443": 1478,
      "action": 1479,
      "visited": 1480,
      "perimeter": 1481,
      "surface": 1482,
      "encountering": 1483,
      "references": 1484,
      "surrounded": 1485,
      "exiting": 1486,
      "combining": 1487,
      "ahead": 1488,
      "build": 1489,
      "elij": 1490,
      "identif": 1491,
      "khalid": 1492,
      "kitchen": 1493,
      "qadir": 1494,
      "terms": 1495,
      "zara": 1496,
      "unnecessary": 1497,
      "adjacent": 1498,
      "details": 1499,
      "elijah": 1500,
      "identify": 1501
    }
  }
}